const surahs = [
    {
        "number": 1,
        "name": "سُورَةُ ٱلْفَاتِحَةِ",
    },
    {
        "number": 2,
        "name": "سُورَةُ البَقَرَةِ",
    },
    {
        "number": 3,
        "name": "سُورَةُ آلِ عِمۡرَانَ",
    },
    {
        "number": 4,
        "name": "سُورَةُ النِّسَاءِ",
    },
    {
        "number": 5,
        "name": "سُورَةُ المَائـِدَةِ",
    },
    {
        "number": 6,
        "name": "سُورَةُ الأَنۡعَامِ",
    },
    {
        "number": 7,
        "name": "سُورَةُ الأَعۡرَافِ",
    },
    {
        "number": 8,
        "name": "سُورَةُ الأَنفَالِ",
    },
    {
        "number": 9,
        "name": "سُورَةُ التَّوۡبَةِ",
    },
    {
        "number": 10,
        "name": "سُورَةُ يُونُسَ",
    },
    {
        "number": 11,
        "name": "سُورَةُ هُودٍ",
    },
    {
        "number": 12,
        "name": "سُورَةُ يُوسُفَ",
    },
    {
        "number": 13,
        "name": "سُورَةُ الرَّعۡدِ",
    },
    {
        "number": 14,
        "name": "سُورَةُ إِبۡرَاهِيمَ",
    },
    {
        "number": 15,
        "name": "سُورَةُ الحِجۡرِ",
    },
    {
        "number": 16,
        "name": "سُورَةُ النَّحۡلِ",
    },
    {
        "number": 17,
        "name": "سُورَةُ الإِسۡرَاءِ",
    },
    {
        "number": 18,
        "name": "سُورَةُ الكَهۡفِ",
    },
    {
        "number": 19,
        "name": "سُورَةُ مَرۡيَمَ",
    },
    {
        "number": 20,
        "name": "سُورَةُ طه",
    },
    {
        "number": 21,
        "name": "سُورَةُ الأَنبِيَاءِ",
    },
    {
        "number": 22,
        "name": "سُورَةُ الحَجِّ",
    },
    {
        "number": 23,
        "name": "سُورَةُ المُؤۡمِنُونَ",
    },
    {
        "number": 24,
        "name": "سُورَةُ النُّورِ",
    },
    {
        "number": 25,
        "name": "سُورَةُ الفُرۡقَانِ",
    },
    {
        "number": 26,
        "name": "سُورَةُ الشُّعَرَاءِ",
    },
    {
        "number": 27,
        "name": "سُورَةُ النَّمۡلِ",
    },
    {
        "number": 28,
        "name": "سُورَةُ القَصَصِ",
    },
    {
        "number": 29,
        "name": "سُورَةُ العَنكَبُوتِ",
    },
    {
        "number": 30,
        "name": "سُورَةُ الرُّومِ",
    },
    {
        "number": 31,
        "name": "سُورَةُ لُقۡمَانَ",
    },
    {
        "number": 32,
        "name": "سُورَةُ السَّجۡدَةِ",
    },
    {
        "number": 33,
        "name": "سُورَةُ الأَحۡزَابِ",
    },
    {
        "number": 34,
        "name": "سُورَةُ سَبَإٍ",
    },
    {
        "number": 35,
        "name": "سُورَةُ فَاطِرٍ",
    },
    {
        "number": 36,
        "name": "سُورَةُ يسٓ",
    },
    {
        "number": 37,
        "name": "سُورَةُ الصَّافَّاتِ",
    },
    {
        "number": 38,
        "name": "سُورَةُ صٓ",
    },
    {
        "number": 39,
        "name": "سُورَةُ الزُّمَرِ",
    },
    {
        "number": 40,
        "name": "سُورَةُ غَافِرٍ",
    },
    {
        "number": 41,
        "name": "سُورَةُ فُصِّلَتۡ",
    },
    {
        "number": 42,
        "name": "سُورَةُ الشُّورَىٰ",
    },
    {
        "number": 43,
        "name": "سُورَةُ الزُّخۡرُفِ",
    },
    {
        "number": 44,
        "name": "سُورَةُ الدُّخَانِ",
    },
    {
        "number": 45,
        "name": "سُورَةُ الجَاثِيَةِ",
    },
    {
        "number": 46,
        "name": "سُورَةُ الأَحۡقَافِ",
    },
    {
        "number": 47,
        "name": "سُورَةُ مُحَمَّدٍ",
    },
    {
        "number": 48,
        "name": "سُورَةُ الفَتۡحِ",
    },
    {
        "number": 49,
        "name": "سُورَةُ الحُجُرَاتِ",
    },
    {
        "number": 50,
        "name": "سُورَةُ قٓ",
    },
    {
        "number": 51,
        "name": "سُورَةُ الذَّارِيَاتِ",
    },
    {
        "number": 52,
        "name": "سُورَةُ الطُّورِ",
    },
    {
        "number": 53,
        "name": "سُورَةُ النَّجۡمِ",
    },
    {
        "number": 54,
        "name": "سُورَةُ القَمَرِ",
    },
    {
        "number": 55,
        "name": "سُورَةُ الرَّحۡمَٰن",
    },
    {
        "number": 56,
        "name": "سُورَةُ الوَاقِعَةِ",
    },
    {
        "number": 57,
        "name": "سُورَةُ الحَدِيدِ",
    },
    {
        "number": 58,
        "name": "سُورَةُ المُجَادلَةِ",
    },
    {
        "number": 59,
        "name": "سُورَةُ الحَشۡرِ",
    },
    {
        "number": 60,
        "name": "سُورَةُ المُمۡتَحنَةِ",
    },
    {
        "number": 61,
        "name": "سُورَةُ الصَّفِّ",
    },
    {
        "number": 62,
        "name": "سُورَةُ الجُمُعَةِ",
    },
    {
        "number": 63,
        "name": "سُورَةُ المُنَافِقُونَ",
    },
    {
        "number": 64,
        "name": "سُورَةُ التَّغَابُنِ",
    },
    {
        "number": 65,
        "name": "سُورَةُ الطَّلَاقِ",
    },
    {
        "number": 66,
        "name": "سُورَةُ التَّحۡرِيمِ",
    },
    {
        "number": 67,
        "name": "سُورَةُ المُلۡكِ",
    },
    {
        "number": 68,
        "name": "سُورَةُ القَلَمِ",
    },
    {
        "number": 69,
        "name": "سُورَةُ الحَاقَّةِ",
    },
    {
        "number": 70,
        "name": "سُورَةُ المَعَارِجِ",
    },
    {
        "number": 71,
        "name": "سُورَةُ نُوحٍ",
    },
    {
        "number": 72,
        "name": "سُورَةُ الجِنِّ",
    },
    {
        "number": 73,
        "name": "سُورَةُ المُزَّمِّلِ",
    },
    {
        "number": 74,
        "name": "سُورَةُ المُدَّثِّرِ",
    },
    {
        "number": 75,
        "name": "سُورَةُ القِيَامَةِ",
    },
    {
        "number": 76,
        "name": "سُورَةُ الإِنسَانِ",
    },
    {
        "number": 77,
        "name": "سُورَةُ المُرۡسَلَاتِ",
    },
    {
        "number": 78,
        "name": "سُورَةُ النَّبَإِ",
    },
    {
        "number": 79,
        "name": "سُورَةُ النَّازِعَاتِ",
    },
    {
        "number": 80,
        "name": "سُورَةُ عَبَسَ",
    },
    {
        "number": 81,
        "name": "سُورَةُ التَّكۡوِيرِ",
    },
    {
        "number": 82,
        "name": "سُورَةُ الانفِطَارِ",
    },
    {
        "number": 83,
        "name": "سُورَةُ المُطَفِّفِينَ",
    },
    {
        "number": 84,
        "name": "سُورَةُ الانشِقَاقِ",
    },
    {
        "number": 85,
        "name": "سُورَةُ البُرُوجِ",
    },
    {
        "number": 86,
        "name": "سُورَةُ الطَّارِقِ",
    },
    {
        "number": 87,
        "name": "سُورَةُ الأَعۡلَىٰ",
    },
    {
        "number": 88,
        "name": "سُورَةُ الغَاشِيَةِ",
    },
    {
        "number": 89,
        "name": "سُورَةُ الفَجۡرِ",
    },
    {
        "number": 90,
        "name": "سُورَةُ البَلَدِ",
    },
    {
        "number": 91,
        "name": "سُورَةُ الشَّمۡسِ",
    },
    {
        "number": 92,
        "name": "سُورَةُ اللَّيۡلِ",
    },
    {
        "number": 93,
        "name": "سُورَةُ الضُّحَىٰ",
    },
    {
        "number": 94,
        "name": "سُورَةُ الشَّرۡحِ",
    },
    {
        "number": 95,
        "name": "سُورَةُ التِّينِ",
    },
    {
        "number": 96,
        "name": "سُورَةُ العَلَقِ",
    },
    {
        "number": 97,
        "name": "سُورَةُ القَدۡرِ",
    },
    {
        "number": 98,
        "name": "سُورَةُ البَيِّنَةِ",
    },
    {
        "number": 99,
        "name": "سُورَةُ الزَّلۡزَلَةِ",
    },
    {
        "number": 100,
        "name": "سُورَةُ العَادِيَاتِ",
    },
    {
        "number": 101,
        "name": "سُورَةُ القَارِعَةِ",
    },
    {
        "number": 102,
        "name": "سُورَةُ التَّكَاثُرِ",
    },
    {
        "number": 103,
        "name": "سُورَةُ العَصۡرِ",
    },
    {
        "number": 104,
        "name": "سُورَةُ الهُمَزَةِ",
    },
    {
        "number": 105,
        "name": "سُورَةُ الفِيلِ",
    },
    {
        "number": 106,
        "name": "سُورَةُ قُرَيۡشٍ",
    },
    {
        "number": 107,
        "name": "سُورَةُ المَاعُونِ",
    },
    {
        "number": 108,
        "name": "سُورَةُ الكَوۡثَرِ",
    },
    {
        "number": 109,
        "name": "سُورَةُ الكَافِرُونَ",
    },
    {
        "number": 110,
        "name": "سُورَةُ النَّصۡرِ",
    },
    {
        "number": 111,
        "name": "سُورَةُ المَسَدِ",
    },
    {
        "number": 112,
        "name": "سُورَةُ الإِخۡلَاصِ",
    },
    {
        "number": 113,
        "name": "سُورَةُ الفَلَقِ",
    },
    {
        "number": 114,
        "name": "سُورَةُ النَّاسِ",
    }
]

export default surahs
