const verses = [
    {
        content: `
        إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا
        `,
        sora: `
        الأحزاب
        `,
        ayah: "56",
        tafseer: {
            content: `
            إن الله تعالى يثني على النبي صلى الله عليه وسلم عند الملائكة المقربين، وملائكته يثنون على النبي ويدعون له، يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، صلُّوا على رسول لله، وسلِّموا تسليمًا، تحية وتعظيمًا له. وصفة الصلاة على النبي صلى الله عليه وسلم ثبتت في السنة على أنواع، منها: "اللهم صلِّ على محمد وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد".
            `,
            source: "https://surahquran.com/aya-56-sora-33.html",
        },
    },
    {
        content: `
        الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ
        `,
        sora: `
        الرعد
        `,
        ayah: "28",
        tafseer: {
            content: `ثم ذكر تعالى علامة المؤمنين فقال: { الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ }- أي: يزول قلقها واضطرابها، وتحضرها أفراحها ولذاتها.{ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ }- أي: حقيق بها وحريٌّ أن لا تطمئن لشيء سوى ذكره، فإنه لا شيء ألذ للقلوب ولا أشهى ولا أحلى من محبة خالقها، والأنس به ومعرفته، وعلى قدر معرفتها بالله ومحبتها له، يكون ذكرها له، هذا على القول بأن ذكر الله، ذكر العبد لربه، من تسبيح وتهليل وتكبير وغير ذلك.وقيل: إن المراد بذكر الله كتابه الذي أنزله ذكرى للمؤمنين، فعلى هذا معنى طمأنينة القلوب بذكر الله: أنها حين تعرف معاني القرآن وأحكامه تطمئن لها،`,
            source:
                "https://surahquran.com/aya-tafsir-28-13.html#:~:text=%D8%AB%D9%85%20%D8%B0%D9%83%D8%B1%20%D8%AA%D8%B9%D8%A7%D9%84%D9%89%20%D8%B9%D9%84%D8%A7%D9%85%D8%A9%20%D8%A7%D9%84%D9%85%D8%A4%D9%85%D9%86%D9%8A%D9%86,%D9%85%D9%86%20%D9%85%D8%AD%D8%A8%D8%A9%20%D8%AE%D8%A7%D9%84%D9%82%D9%87%D8%A7%D8%8C%20%D9%88%D8%A7%D9%84%D8%A3%D9%86%D8%B3%20%D8%A8%D9%87",
        },
    },
    {
        content: `
        وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "186",
        tafseer: {
            content: `وإذا سألك - أيها النبي - عبادي عن قربي وإجابتي لدعائهم؛ فإني قريب منهم، عالم بأحوالهم، سامع لدعائهم، فلا يحتاجون إلى وسطاء، ولا إلى رفع أصواتهم، أُجيب دعوة الداعي إذا دعاني مخلصًا في دعائه، فلينقادوا لي ولأوامري، وليثبتوا على إيمانهم؛ فإن ذلك أنفع وسيلة لإجابتي، لعلهم يسلكون بذلك سبيل الرشد في شؤونهم الدينية والدنيوية`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=186",
        },
    },
    {
        content: `
        يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ
        `,
        sora: `
        الحجرات
        `,
        ayah: "13",
        tafseer: {
            content: `يا أيها الناس، إنا خلقناكم من ذكر واحد وهو أبوكم آدم، وأنثى واحدة وهي أمكم حواء، فنسبكم واحد، فلا يفخر بعضكم على بعض في النسب، وصيّرناكم بعد ذلك شعوبًا كثيرة وقبائل منتشرة؛ ليعرف بعضكم بعضًا، لا ليفخر عليه؛ لأن التمايز لا يكون إلا بالتقوى، لذا قال: إن أكرمكم عند الله أتقاكم، إن الله عليم بأحوالكم، خبير بما تكونون عليه من كمال ونقص، لا يخفى عليه شيء من ذلك.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=49&aya=13",
        },
    },
    {
        content: `
        إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "6",
        tafseer: {
            content: `فلهذا لما ذكر صفات المؤمنين حقا, ذكر صفات الكفار المظهرين لكفرهم، المعاندين للرسول يخبر تعالى أن الذين كفروا,- أي: اتصفوا بالكفر, وانصبغوا به, وصار وصفا لهم لازما, لا يردعهم عنه رادع, ولا ينجع فيهم وعظ، إنهم مستمرون على كفرهم, فسواء عليهم أأنذرتهم, أم لم تنذرهم لا يؤمنون، وحقيقة الكفر: هو الجحود لما جاء به الرسول, أو جحد بعضه، فهؤلاء الكفار لا تفيدهم الدعوة إلا إقامة الحجة, وكأن في هذا قطعا لطمع الرسول صلى الله عليه وسلم في إيمانهم, وأنك لا تأس عليهم, ولا تذهب نفسك عليهم حسرات.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=6",
        },
    },
    {
        content: `
        وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِينَ
        `,
        sora: `
        هود
        `,
        ayah: "114",
        tafseer: {
            content: `وأقم - أيها الرسول - الصلاة على أحسن وجه في طرفي النهار وهما أول النهار وآخره، وأقمها في ساعات من الليل، إن الأعمال الصالحات تمحو صغائر الذنوب، ذلك المذكور موعظة للمتعظين، وعبرة للمعتبرين.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=11&aya=114",
        },
    },
    {
        content: `
        اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `,
        sora: `
        البقرة
        `,
        ayah: "255",
        tafseer: {
            content: `الله الذي لا إله يُعبد بحقٍّ إلا هو وحده دون سواه، الحي حياة كاملة لا موت فيها ولا نقص، القيوم الذي قام بنفسه فاستغنى عن جميع خلقه، وبه قامت جميع المخلوقات فلا تستغني عنه في كل أحوالها، لا يأخذه نعاس ولا نوم؛ لكمال حياته وقيوميته، له وحده ملك ما في السماوات وما في الأرض، لا يملك أحد أن يشفع عنده لأحد إلا بعد إذنه ورضاه، يعلم ما مضى من أمور خلقه مما وقع، وما يستقبلونه مما لم يقع، ولا يحيطون بشيء من علمه تعالى إلا بما شاء أن يطلعهم عليه، أحاط كرسيه بالسماوات والأرض على سَعَتِهما وعِظَمِهما، ولا يُثْقِلُه أو يشق عليه حفظهما، وهو العَليُّ بذاته وقَدْرِه وقَهْرِه، العظيم في ملكه وسلطانه.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=255",
        },
    },
    {
        content: `
        وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ
        `,
        sora: `
        الذاريات
        `,
        ayah: "56",
        tafseer: {
            content: `وما خلقت الجن والإنس إلا لعبادتي وحدي، ما خلقتهم ليجعلوا لي شريكًا.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=51&aya=56",
        },
    },
    {
        content: `
        وَلَن تَرْضَىٰ عَنكَ الْيَهُودُ وَلَا النَّصَارَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ ۗ قُلْ إِنَّ هُدَى اللَّهِ هُوَ الْهُدَىٰ ۗ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَ الَّذِي جَاءَكَ مِنَ الْعِلْمِ ۙ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ
        `,
        sora: `
        البقرة
        `,
        ayah: "120",
        tafseer: {
            content: `يخاطب الله نبيه موجهًا محذرًا قائلًا له: لن ترضى عنك اليهود ولا النصارى حتَّى تترك الإسلام، وتتبع ما هم عليه، قل: إن كتاب الله وبيانه هو الهدى حقًّا، لا ما هم عليه من الباطل، ولئن حصل الاتباع لهم منك أو من أحد من أتباعك بعد الَّذي جاءك من الحق الواضح فلن تجد من الله مناصرة أو معونة، وهذا من باب بيان خطورة ترك الحق ومجاراة أهل الباطل.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=120",
        },
    },
    {
        content: `
        لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ
        `,
        sora: `
        البقرة
        `,
        ayah: "286",
        tafseer: {
            content: `لا يكلف الله نفسًا إلا ما تطيق من الأعمال؛ لأن دين الله مبني على اليسر فلا مشقة فيه، فمن كسب خيرًا فله ثواب ما عمل لا يُنْقَصُ منه شيء، ومن كسب شرًّا فعليه جزاء ما اكتسب من ذنب لا يحمله عنه غيره.
وقال الرسول والمؤمنون: ربنا لا تعاقبنا إن نسينا أو أخطأنا في فعل أو قول بلا قصد منا، ربنا ولا تكلِّفنا ما يشق علينا ولا نطيقه، كما كلَّفت من قبلنا ممن عاقبتهم على ظلمهم كاليهود، ولا تحمِّلنا ما يشق علينا ولا نطيقه من الأوامر والنواهي، وتجاوز عن ذنوبنا، واغفر لنا، وارحمنا بفضلك، أنت ولينا وناصرنا فانصرنا على القوم الكافرين.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=286",
        },
    },
    {
        content: `
        قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا ۚ هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ
        `,
        sora: `
        التوبة
        `,
        ayah: "51",
        tafseer: {
            content: `قل - أيها الرسول - لهؤلاء المنافقين: لن ينالنا إلا ما كتبه الله لنا، فهو سبحانه سيدنا وملجؤنا الذي نلجأ إليه، ونحن متوكلون عليه في أمورنا، وإليه وحده يفوض المؤمنون أمورهم، فهو كافيهم، ونعم الوكيل.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=9&aya=51",
        },
    },
    {
        content: `
        أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا یَكُونُوا۟ كَٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلُ فَطَالَ عَلَیۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِیرࣱ مِّنۡهُمۡ فَـٰسِقُونَ
        `,
        sora: `
        الحديد
        `,
        ayah: "16",
        tafseer: {
            content: `لما ذكر حال المؤمنين والمؤمنات والمنافقين والمنافقات في الدار الآخرة، كان ذلك مما يدعو القلوب إلى الخشوع لربها، والاستكانة لعظمته، فعاتب الله المؤمنين [على عدم ذلك]، فقال: { أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ }أي: ألم يجئ الوقت الذي تلين به قلوبهم وتخشع لذكر الله، الذي هو القرآن، وتنقاد لأوامره وزواجره، وما نزل من الحق الذي جاء به محمد صلى الله عليه وسلم؟ وهذا فيه الحث على الاجتهاد على خشوع القلب لله تعالى، ولما أنزله من الكتاب والحكمة، وأن يتذكر المؤمنون المواعظ الإلهية والأحكام الشرعية كل وقت، ويحاسبوا أنفسهم على ذلك، { وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ }- أي: ولا يكونوا كالذين أنزل الله عليهم الكتاب الموجب لخشوع القلب والانقياد التام، ثم لم يدوموا عليه، ولا ثبتوا، بل طال عليهم الزمان واستمرت بهم الغفلة، فاضمحل إيمانهم وزال إيقانهم، { فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ } فالقلوب تحتاج في كل وقت إلى أن تذكر بما أنزل له الله، وتناطق بالحكمة، ولا ينبغي الغفلة عن ذلك، فإن ذلك سبب لقسوة القلب وجمود العين.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=57&aya=16",
        },
    },
    {
        content: `
        أَتَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبِرِّ وَتَنسَوۡنَ أَنفُسَكُمۡ وَأَنتُمۡ تَتۡلُونَ ٱلۡكِتَـٰبَۚ أَفَلَا تَعۡقِلُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "44",
        tafseer: {
            content: `{ أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ }- أي: بالإيمان والخير { وَتَنْسَوْنَ أَنْفُسَكُمْ }- أي: تتركونها عن أمرها بذلك، والحال: { وَأَنْتُمْ تَتْلُونَ الْكِتَابَ أَفَلَا تَعْقِلُونَ } وأسمى العقل عقلا لأنه يعقل به ما ينفعه من الخير, وينعقل به عما يضره، وذلك أن العقل يحث صاحبه أن يكون أول فاعل لما يأمر به, وأول تارك لما ينهى عنه، فمن أمر غيره بالخير ولم يفعله, أو نهاه عن الشر فلم يتركه, دل على عدم عقله وجهله, خصوصا إذا كان عالما بذلك, قد قامت عليه الحجة.
وهذه الآية, وإن كانت نزلت في سبب بني إسرائيل, فهي عامة لكل أحد لقوله تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ } وليس في الآية أن الإنسان إذا لم يقم بما أمر به أنه يترك الأمر بالمعروف, والنهي عن المنكر, لأنها دلت على التوبيخ بالنسبة إلى الواجبين، وإلا فمن المعلوم أن على الإنسان واجبين: أمر غيره ونهيه, وأمر نفسه ونهيها، فترك أحدهما, لا يكون رخصة في ترك الآخر، فإن الكمال أن يقوم الإنسان بالواجبين, والنقص الكامل أن يتركهما، وأما قيامه بأحدهما دون الآخر, فليس في رتبة الأول, وهو دون الأخير، وأيضا فإن النفوس مجبولة على عدم الانقياد لمن يخالف قوله فعله، فاقتداؤهم بالأفعال أبلغ من اقتدائهم بالأقوال المجردة.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=44",
        },
    },
    {
        content: `
        وَٱسۡتَعِینُوا۟ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِیرَةٌ إِلَّا عَلَى ٱلۡخَـٰشِعِینَ
        `,
        sora: `
        البقرة
        `,
        ayah: "45",
        tafseer: {
            content: `واطلبوا العون على كل أحوالكم الدينية والدنيوية؛ بالصبر وبالصلاة التي تقربكم إلى الله وتصلكم به، فيعينكم ويحفظكم ويذهب ما بكم من ضر، وإن الصلاة لشاقة وعظيمة إلا على الخاضعين لربهم.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=45",
        },
    },
    {
        content: `
        إِنَّ ٱلۡمُصَّدِّقِینَ وَٱلۡمُصَّدِّقَـٰتِ وَأَقۡرَضُوا۟ ٱللَّهَ قَرۡضًا حَسَنࣰا یُضَـٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرࣱ كَرِیمࣱ
        `,
        sora: `
        الحديد
        `,
        ayah: "18",
        tafseer: {
            content: `ن المتصدقين ببعض أموالهم، والمتصدقات ببعض أموالهنّ، الذين ينفقونها طيبة بها نفوسهم دون مَنٍّ ولا أذى، يُضاعَف لهم ثواب أعمالهم: الحسنة بعشر أمثالها إلى سبع مئة ضعف إلى أضعاف كثيرة، ولهم مع ذلك ثواب كريم عند الله وهو الجنة.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=57&aya=18",
        },
    },
    {
        content: `
        إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَٱلَّذِینَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔینَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَعَمِلَ صَـٰلِحࣰا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "62",
        tafseer: {
            content: `إن مَن آمن مِن هذه الأمة، وكذلك من آمن من الأمم الماضية قبل بعثة محمد صلى الله عليه وسلم من يهود ونصارى وصابئة - وهم طائفة من أتباع بعض الأنبياء - من تحقق فيهم الإيمان بالله وباليوم الآخر؛ فلهم ثوابهم عند ربهم، ولا خوف عليهم مما يستقبلونه في الآخرة، ولا يحزنون على ما فاتهم من الدنيا.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=62",
        },
    },
    {
        content: `
        وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا عَدۡلࣱ وَلَا تَنفَعُهَا شَفَـٰعَةࣱ وَلَا هُمۡ یُنصَرُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "123",
        tafseer: {
            content: `واجعلوا بينكم وبين عذاب يوم القيامة وقايةً؛ باتباع أوامر الله واجتناب نواهيه، فإنه لا تُغْنِي - في ذلك اليوم - نفسٌ عن نفس شيئًا، ولا يُقْبل منها فيه أي فداء مهما عَظُمَ، ولا تنفعها فيه شفاعة من أحد مهما علا مكانه، وليس لها نصير ينصرها من دون الله.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=123",
        },
    },
    {
        content: `
        وَمِنۡهُم مَّن یَقُولُ رَبَّنَاۤ ءَاتِنَا فِی ٱلدُّنۡیَا حَسَنَةࣰ وَفِی ٱلۡـَٔاخِرَةِ حَسَنَةࣰ وَقِنَا عَذَابَ ٱلنَّارِ
        `,
        sora: `
        البقرة
        `,
        ayah: "201",
        tafseer: {
            content: `وفريق من الناس مؤمن بالله يؤمن بالآخرة، فيسأل ربه نعيم الدنيا والعمل الصالح فيها، كما يسأله الفوز بالجنة والسلامة من عذاب النار.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=201",
        },
    },
    {
        content: `
        یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱدۡخُلُوا۟ فِی ٱلسِّلۡمِ كَاۤفَّةࣰ وَلَا تَتَّبِعُوا۟ خُطُوَ ٰ⁠تِ ٱلشَّیۡطَـٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوࣱّ مُّبِینࣱ
        `,
        sora: `
        البقرة
        `,
        ayah: "208",
        tafseer: {
            content: `يا أيها الذين آمنوا بالله واتبعوا رسوله ادخلوا في الإسلام جميعه، ولا تتركوا منه شيئًا، كما يفعل أهل الكتاب من الإيمان ببعض الكتاب والكفر ببعضه، ولا تتبعوا مسالك الشيطان؛ لأنه لكم عدو واضح العداوة مُظْهِرُها.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=2&aya=208",
        },
    },
    {
        content: `
        وَجَاءُوا عَلَىٰ قَمِيصِهِ بِدَمٍ كَذِبٍ ۚ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ
        `,
        sora: `
        يوسف
        `,
        ayah: "18",
        tafseer: {
            content: `وأكدوا خبرهم بحيلة، فجاؤوا بقميص يوسف ملطّخًا بدم غير دمه، موهمين أنه أثر أكل الذئب له، ففطن يعقوب - بقرينة أن القميص لم يُمَزَّق- لكذبهم، فقال لهم: ليس الأمر كما أخبرتم، بل زيّنت لكم أنفسكم أمرًا سيئًا صنعتموه به، فأمري صبر جميل لا جزع فيه، والله المطلوب منه العون على ما تذكرونه من أمر يوسف.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=12&aya=18",
        },
    },
    {
        content: `
        رَّبِّ ٱغۡفِرۡ لِی وَلِوَ ٰ⁠لِدَیَّ وَلِمَن دَخَلَ بَیۡتِیَ مُؤۡمِنࣰا وَلِلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِۖ وَلَا تَزِدِ ٱلظَّـٰلِمِینَ إِلَّا تَبَارَۢا
        `,
        sora: `
        نوح
        `,
        ayah: "28",
        tafseer: {
            content: `وقال نوح -عليه السلام- بعد يأسه من قومه: ربِّ لا تترك من الكافرين بك أحدًا حيًّا على الأرض يدور ويتحرك. إنك إن تتركهم دون إهلاك يُضلوا عبادك الذين قد آمنوا بك عن طريق الحق، ولا يأت من أصلابهم وأرحامهم إلا مائل عن الحق شديد الكفر بك والعصيان لك. ربِّ اغفر لي ولوالديَّ ولمن دخل بيتي مؤمنًا، وللمؤمنين والمؤمنات بك، ولا تزد الكافرين إلا هلاكًا وخسرانًا في الدنيا والآخرة.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=71&aya=28`,
        },
    },
    {
        content: `
        وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ
        `,
        sora: `
        فصلت
        `,
        ayah: "34",
        tafseer: {
            content: `ولا تستوي حسنة الذين آمنوا بالله، واستقاموا على شرعه، وأحسنوا إلى خلقه، وسيئة الذين كفروا به وخالفوا أمره، وأساؤوا إلى خلقه. ادفع بعفوك وحلمك وإحسانك مَن أساء إليك، وقابل إساءته لك بالإحسان إليه، فبذلك يصير المسيء إليك الذي بينك وبينه عداوة كأنه قريب لك شفيق عليك. وما يُوفَّق لهذه الخصلة الحميدة إلا الذين صبروا أنفسهم على ما تكره، وأجبروها على ما يحبه الله، وما يُوفَّق لها إلا ذو نصيب وافر من السعادة في الدنيا والآخرة.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=41&aya=34`,
        },
    },
    {
        content: `
        مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ
        `,
        sora: `
        ق
        `,
        ayah: "18",
        tafseer: {
            content: `ما يقول من قول إلا لديه ملك رقيب على ما يقوله حاضر.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=50&aya=18`,
        },
    },
    {
        content: `
        فَلَا تُزَكُّوا أَنفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ اتَّقَىٰ
        `,
        sora: `
        النجم
        `,
        ayah: "32",
        tafseer: {
            content: `لذين يبتعدون عن كبائر الذنوب، وقبائح المعاصي إلا صغائر الذنوب، فهذه تغفر بترك الكبائر، والإكثار من الطاعات، إن ربك - أيها الرسول - واسع المغفرة، يغفر ذنوب عباده متى تابوا منها، هو سبحانه أعلم بأحوالكم وشؤونكم حين خلق أباكم آدم من تراب، وحين كنتم حملًا في بطون أمهاتكم تُخْلقون خلقًا من بعد خلق، لا يخفى عليه شيء من ذلك، فلا تمدحوا أنفسكم بالثناء عليها بالتقوى، فهو سبحانه أعلم بمن اتقاه؛ بامتثال أوامره، واجتناب نواهيه.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=53&aya=32`,
        },
    },
    {
        content: `
        إِنَّمَا يَخْشَى اللَّـهَ مِنْ عِبَادِهِ الْعُلَمَاءُ
        `,
        sora: `
        فاطر
        `,
        ayah: "28",
        tafseer: {
            content: `ومن الناس، ومن الدواب، ومن الأنعام (الإبل، والبقر، والغنم) مختلف ألوانه مثل ذلك المذكور، إنما يعظم مقام الله تعالى ويخشاه العالمون به سبحانه؛ لأنهم عرفوا صفاته وشرعه ودلائل قدرته، إن الله عزيز لا يغالبه أحد، غفور لذنوب من تاب من عباده.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=35&aya=28`,
        },
    },
    {
        content: `
        لَئِن شَكَرْ‌تُمْ لَأَزِيدَنَّكُمْ
        `,
        sora: `
        إبراهيم
        `,
        ayah: "7",
        tafseer: {
            content: `وقال لهم موسى: اذكروا حين أعلمكم ربكم إعلامًا بليغًا: لئن شكرتم الله على ما أنعم به عليكم من تلك النعم المذكورة ليزيدنكم عليها من إنعامه وفضله، ولئن جحدتم نعمه عليكم ولم تشكروها، فإن عذابه لشديد لمن يجحد نعمه ولا يشكرها.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=14&aya=7`,
        },
    },
    {
        content: `
        فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ
        `,
        sora: `
        البقرة
        `,
        ayah: "152",
        tafseer: {
            content: `فاذكروني بقلوبكم وجوارحكم؛ أذكركم بالثناء عليكم والحفظ لكم، فالجزاء من جنس العمل، واشكروا لي نعمي التي أنعمت بها عليكم، ولا تكفروني بجحودها، واستعمالها فيما حُرِّم عليكم.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=2&aya=152`,
        },
    },
    {
        content: `
        وَإِذۡ جَعَلۡنَا ٱلۡبَیۡتَ مَثَابَةࣰ لِّلنَّاسِ وَأَمۡنࣰا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبۡرَ ٰ⁠هِـۧمَ مُصَلࣰّىۖ وَعَهِدۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِـۧمَ وَإِسۡمَـٰعِیلَ أَن طَهِّرَا بَیۡتِیَ لِلطَّاۤىِٕفِینَ وَٱلۡعَـٰكِفِینَ وَٱلرُّكَّعِ ٱلسُّجُودِ
        `,
        sora: `
        البقرة
        `,
        ayah: "125",
        tafseer: {
            content: `واذكر حين جعل الله البيت الحرام مرجعًا للناس تتعلق به قلوبهم، كلما رحلوا عنه رجعوا إليه، وجعله أمنًا لهم، لا يُعتَدى عليهم فيه.
وقال للناس: اتخذوا من الحَجَر - الذي كان يقف عليه إبراهيم وهو يبني الكعبة - مكانًا للصلاة.
وأوصينا إبراهيم وابنه إسماعيل بتطهير البيت الحرام من الأقذار والأوثان وتهيئته لمن أراد التعبد فيه بالطواف والاعتكاف والصلاة وغيرها.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=2&aya=125`,
        },
    },
    {
        content: `لَّقَدْ كُنتَ فِي غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ`,
        sora: `ق`,
        ayah: "22",
        tafseer: {
            content: `ويقال لهذا الإنسان المَسُوق: لقد كنت في الدنيا في غفلة عن هذا اليوم بسبب اغترارك بشهواتك ولذاتك، فكشفنا عنك غفلتك بما تعاينه من العذاب والكرب، فبصرك اليوم حادٌّ تدرك به ما كنت في غفلة عنه.`,
            source: `https://surahquran.com/aya_tafseer.php?sora=50&aya=22`,
        },
    },
    {
        content: `يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ `,
        sora: "النساء",
        ayah: "26",
        tafseer: {
            content: `ريد الله سبحانه بتشريعه هذه الأحكام لكم أن يبين لكم معالم شرعه ودينه، وما فيه مصالحكم في الدنيا والآخرة، ويريد أن يرشدكم إلى طرق الأنبياء من قبلكم في التحليل والتحريم، وشمائلهم الكريمة، وسيرهم الحميدة لتتبعوهم، ويريد أن يرجع بكم عن معصيته إلى طاعته، والله عليم بما فيه مصلحة عباده فيشرعه لهم، حكيم في تشريعه وتدبيره لشؤونهم.`,
            source: `https://surahquran.com/aya-tafsir-26-4.html#`,
        },
    },
    {
        content: ` أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ`,
        sora: `البقرة`,
        ayah: "75",
        tafseer: {
            content: `يقول تعالى : ( أفتطمعون ) أيها المؤمنون ( أن يؤمنوا لكم ) أي : ينقاد لكم بالطاعة ، هؤلاء الفرقة الضالة من اليهود ، الذين شاهد آباؤهم من الآيات البينات ما شاهدوه ثم قست قلوبهم من بعد ذلك ( وقد كان فريق منهم يسمعون كلام الله ثم يحرفونه ) أي : يتأولونه على غير تأويله ( من بعد ما عقلوه ) أي : فهموه على الجلية ومع هذا يخالفونه على بصيرة ( وهم يعلمون ) أنهم مخطئون فيما ذهبوا إليه من تحريفه وتأويله ؟ وهذا المقام شبيه بقوله تعالى : ( فبما نقضهم ميثاقهم لعناهم وجعلنا قلوبهم قاسية يحرفون الكلم عن مواضعه )`,
            source: "https://quran4all.net/ar/tafsir/3/2/75",
        },
    },
    {
        content: `يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ`,
        sora: `الحجرات`,
        ayah: "6",
        tafseer: {
            content: `وهذا أيضًا، من الآداب التي على أولي الألباب، التأدب بها واستعمالها، وهو أنه إذا أخبرهم فاسق بخبر أن يتثبتوا في خبره، ولا يأخذوه مجردًا، فإن في ذلك خطرًا كبيرًا، ووقوعًا في الإثم، فإن خبره إذا جعل بمنزلة خبر الصادق العدل، حكم بموجب ذلك ومقتضاه، فحصل من تلف النفوس والأموال، بغير حق، بسبب ذلك الخبر ما يكون سببًا للندامة، بل الواجب عند خبر الفاسق، التثبت والتبين، فإن دلت الدلائل والقرائن على صدقه، عمل به وصدق، وإن دلت على كذبه، كذب، ولم يعمل به، ففيه دليل، على أن خبر الصادق مقبول، وخبر الكاذب، مردود، وخبر الفاسق متوقف فيه كما ذكرنا، ولهذا كان السلف يقبلون روايات كثير [من] الخوارج، المعروفين بالصدق، ولو كانوا فساقًا.`,
            source: "https://surahquran.com/Explanation.php?sora=49&aya=6",
        },
    },
    {
        content: `وَقالَ إِنِّي ذاهِبٌ إِلى رَبِّي سَيَهْدِينِ`,
        sora: `الصافات`,
        ayah: "99",
        tafseer: {
            content: `وَ لما فعلوا فيه هذا الفعل، وأقام عليهم الحجة، وأعذر منهم، قال إِنِّي ذَاهِبٌ إِلَى رَبِّي أي: مهاجر إليه، قاصد إلى الأرض المباركة أرض الشام.
سَيَهْدِينِ يدلني إلى ما فيه الخير لي، من أمر ديني ودنياي، وقال في الآية الأخرى: وَأَعْتَزِلُكُمْ وَمَا تَدْعُونَ مِنْ دُونِ اللَّهِ وَأَدْعُو رَبِّي عَسَى أَلَّا أَكُونَ بِدُعَاءِ رَبِّي شَقِيًّا`,
            source: "https://surahquran.com/Explanation.php?sora=37&aya=99",
        },
    },
    {
        content: ` فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ`,
        sora: `الطور`,
        ayah: "27",
        tafseer: {
            content: `فَمَنَّ اللَّهُ عَلَيْنَا بالهداية والتوفيق، وَوَقَانَا عَذَابَ السَّمُومِ أي: العذاب الحار الشديد حره.`,
            source: "https://surahquran.com/Explanation.php?sora=52&aya=27",
        },
    },
    {
        content: `يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ`,
        sora: "البقرة",
        ayah: "21",
        tafseer: {
            content: `هذا أمر عام لكل الناس, بأمر عام, وهو العبادة الجامعة, لامتثال أوامر الله, واجتناب نواهيه, وتصديق خبره, فأمرهم تعالى بما خلقهم له، قال تعالى: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ`,
            source: "https://surahquran.com/Explanation.php?sora=2&aya=21",
        },
    },
    {
        content: `كل من عليها فانٍ * ويبقى وجه ربّك ذو الجلال والإكرام`,
        sora: "الرحمن",
        ayah: "27-26",
        tafseer: {
            content: `كل من على الأرض، من إنس وجن، ودواب، وسائر المخلوقات، يفنى ويموت ويبيد
            ل مَن على وجه الأرض مِن الخلق هالك، ويبقى وجه ربك ذو العظمة والكبرياء والفضل والجود. وفي الآية إثبات صفة الوجه لله تعالى بما يليق به سبحانه، دون تشبيه ولا تكييف.
`,
            source: `https://surahquran.com/aya-26-sora-55.html
            https://surahquran.com/aya-27-sora-55.html
            `,
        },
    },
    {
        content: `يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَىٰ وَمَا هُم بِسُكَارَىٰ وَلَٰكِنَّ عَذَابَ اللَّهِ شَدِيدٌ`,
        sora: "الحج",
        ayah: "2",
        tafseer: {
            content: `يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّا أَرْضَعَتْ مع أنها مجبولة على شدة محبتها لولدها، خصوصا في هذه الحال، التي لا يعيش إلا بها.
وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا من شدة الفزع والهول، وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى أي: تحسبهم -أيها الرائي لهم- سكارى من الخمر، وليسوا سكارى.
وَلَكِنَّ عَذَابَ اللَّهِ شَدِيدٌ فلذلك أذهب عقولهم، وفرغ قلوبهم، وملأها من الفزع، وبلغت القلوب الحناجر، وشخصت الأبصار، وفي ذلك اليوم، لا يجزي والد عن ولده، ولا مولود هو جاز عن والده شيئا.
ويومئذ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ * وَأُمِّهِ وَأَبِيهِ * وَصَاحِبَتِهِ وَبَنِيهِ * لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ وهناك يعض الظالم على يديه، يقول يا ليتني اتخذت مع الرسول سبيلا يا ويلتي ليتني لم أتخذ فلانا خليلا وتسود حينئذ وجوه وتبيض وجوه، وتنصب الموازين، التي يوزن بها مثاقيل الذر، من الخير والشر، وتنشر صحائف الأعمال وما فيها من جميع الأعمال والأقوال والنيات، من صغير وكبير، وينصب الصراط على متن جهنم، وتزلف الجنة للمتقين، وبرزت الجحيم للغاوين.`,
            source: "https://surahquran.com/Explanation.php?sora=22&aya=2",
        },
    },
    {
        content: `
        قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّـهِ إِنَّ اللَّـهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ
        `,
        sora: "الزمر",
        ayah: "53",
        tafseer: {
            content: `بر تعالى عباده المسرفين بسعة كرمه، ويحثهم على الإنابة قبل أن لا يمكنهم ذلك فقال: قُلْ يا أيها الرسول ومن قام مقامه من الدعاة لدين اللّه، مخبرا للعباد عن ربهم: يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ باتباع ما تدعوهم إليه أنفسهم من الذنوب، والسعي في مساخط علام الغيوب.
لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ أي: لا تيأسوا منها، فتلقوا بأيديكم إلى التهلكة، وتقولوا قد كثرت ذنوبنا وتراكمت عيوبنا، فليس لها طريق يزيلها ولا سبيل يصرفها، فتبقون بسبب ذلك مصرين على العصيان، متزودين ما يغضب عليكم الرحمن، ولكن اعرفوا ربكم بأسمائه الدالة على كرمه وجوده، واعلموا أنه يغفر الذنوب جميعا من الشرك، والقتل، والزنا، والربا، والظلم، وغير ذلك من الذنوب الكبار والصغار.
إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ أي: وصفه المغفرة والرحمة، وصفان لازمان ذاتيان، لا تنفك ذاته عنهما، ولم تزل آثارهما سارية في الوجود، مالئة للموجود،.
تسح يداه من الخيرات آناء الليل والنهار، ويوالي النعم على العباد والفواضل في السر والجهار، والعطاء أحب إليه من المنع، والرحمة سبقت الغضب وغلبته، .
ولكن لمغفرته ورحمته ونيلهما أسباب إن لم يأت بها العبد، فقد أغلق على نفسه باب الرحمة والمغفرة، أعظمها وأجلها، بل لا سبب لها غيره، الإنابة إلى اللّه تعالى بالتوبة النصوح، والدعاء والتضرع والتأله والتعبد،.
فهلم إلى هذا السبب الأجل، والطريق الأعظم.`,
            source: "https://surahquran.com/Explanation.php?sora=39&aya=53",
        },
    },
    {
        content: `
        فَاصْبِرْ صَبْرًا جَمِيلً
        `,
        sora: "المعارج",
        ayah: "5",
        tafseer: {
            content: `فاصبر صبراً جميلاً"، يا محمد على تكذيبهم وهذا قبل أن يؤمر بالقتال.`,
            source: `https://surahquran.com/Explanation.php?sora=70&aya=5`,
        },
    },
    {
        content: `
        فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِّن نَّهَارٍ بَلَاغٌ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ
        `,
        sora: "الأحقاف",
        ayah: "35",
        tafseer: {
            content: `ثم أمر تعالى رسوله أن يصبر على أذية المكذبين المعادين له وأن لا يزال داعيا لهم إلى الله وأن يقتدي بصبر أولي العزم من المرسلين سادات الخلق أولي العزائم والهمم العالية الذين عظم صبرهم، وتم يقينهم، فهم أحق الخلق بالأسوة بهم والقفو لآثارهم والاهتداء بمنارهم.
فامتثل صلى الله عليه وسلم لأمر ربه فصبر صبرا لم يصبره نبي قبله حتى رماه المعادون له عن قوس واحدة، وقاموا جميعا بصده عن الدعوة إلى الله وفعلوا ما يمكنهم من المعاداة والمحاربة، وهو صلى الله عليه وسلم لم يزل صادعا بأمر الله مقيما على جهاد أعداء الله صابرا على ما يناله من الأذى، حتى مكن الله له في الأرض وأظهر دينه على سائر الأديان وأمته على الأمم، فصلى الله عليه وسلم تسليما.
وقوله: وَلَا تَسْتَعْجِلْ لَهُمْ أي: لهؤلاء المكذبين المستعجلين للعذاب فإن هذا من جهلهم وحمقهم فلا يستخفنك بجهلهم ولا يحملك ما ترى من استعجالهم على أن تدعو الله عليهم بذلك فإن كل ما هو آت قريب، و كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا في الدنيا إِلَّا سَاعَةً مِنْ نَهَارٍ فلا يحزنك تمتعهم القليل وهم صائرون إلى العذاب الوبيل.
بَلَاغٌ أي: هذه الدنيا متاعها وشهوتها ولذاتها بلغة منغصة ودفع وقت حاضر قليل.
أو هذا القرآن العظيم الذي بينا لكم فيه البيان التام بلاغ لكم، وزاد إلى الدار الآخرة، ونعم الزاد والبلغة زاد يوصل إلى دار النعيم ويعصم من العذاب الأليم، فهو أفضل زاد يتزوده الخلائق وأجل نعمة أنعم الله بها عليهم.
فَهَلْ يُهْلَكُ بالعقوبات إِلَّا الْقَوْمُ الْفَاسِقُونَ أي: الذين لا خير فيهم وقد خرجوا عن طاعة ربهم ولم يقبلوا الحق الذي جاءتهم به الرسل.
وأعذر الله لهم وأنذرهم فبعد ذلك إذ يستمرون على تكذيبهم وكفرهم نسألالله العصمة.
آخر تفسير سورة الأحقاف، والحمد لله رب العالمين`,
            source: `https://surahquran.com/Explanation.php?sora=46&aya=35`,
        },
    },
    {
        content: `
        هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا
        `,
        sora: "الأحزاب",
        ayah: "43",
        tafseer: {
            content: `ي: من رحمته بالمؤمنين ولطفه بهم، أن جعل من صلاته عليهم، وثنائه، وصلاة ملائكته ودعائهم، ما يخرجهم من ظلمات الذنوب والجهل، إلى نور الإيمان، والتوفيق، والعلم، والعمل، فهذه أعظم نعمة، أنعم بها على العباد الطائعين، تستدعي منهم شكرها، والإكثار من ذكر اللّه، الذي لطف بهم ورحمهم، وجعل حملة عرشه، أفضل الملائكة، ومن حوله، يسبحون بحمد ربهم ويستغفرون للذين آمنوا فيقولون: رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُم وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ وَقِهِمْ السَّيِّئَاتِ وَمَنْ تَقِي السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ فهذه رحمته ونعمته عليهم في الدنيا.`,
            source: `https://surahquran.com/Explanation.php?sora=33&aya=43`,
        },
    },
    {
        content: `
        وَإِذا جاءَكَ الَّذينَ يُؤمِنونَ بِآياتِنا فَقُل سَلامٌ عَلَيكُم كَتَبَ رَبُّكُم عَلى نَفسِهِ الرَّحمَةَ أَنَّهُ مَن عَمِلَ مِنكُم سوءًا بِجَهالَةٍ ثُمَّ تابَ مِن بَعدِهِ وَأَصلَحَ فَأَنَّهُ غَفورٌ رَحيمٌ
        `,
        sora: "الأنعام",
        ayah: "54",
        tafseer: {
            content: `ولما نهى الله رسولَه، عن طرد المؤمنين القانتين، أمَره بمقابلتهم بالإكرام والإعظام، والتبجيل والاحترام، فقال: وَإِذَا جَاءَكَ الَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ أي: وإذا جاءك المؤمنون، فحَيِّهم ورحِّب بهم ولَقِّهم منك تحية وسلاما، وبشرهم بما ينشط عزائمهم وهممهم، من رحمة الله، وسَعة جوده وإحسانه، وحثهم على كل سبب وطريق، يوصل لذلك.
ورَهِّبْهم من الإقامة على الذنوب، وأْمُرْهم بالتوبة من المعاصي، لينالوا مغفرة ربهم وجوده، ولهذا قال: كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ أَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِهِ وَأَصْلَحَ أي: فلا بد مع ترك الذنوب والإقلاع، والندم عليها، من إصلاح العمل، وأداء ما أوجب الله، وإصلاح ما فسد من الأعمال الظاهرة والباطنة.
فإذا وجد ذلك كله فَأَنَّهُ غَفُورٌ رَحِيمٌ أي: صب عليهم من مغفرته ورحمته، بحسب ما قاموا به، مما أمرهم به.`,
            source: `https://surahquran.com/Explanation.php?sora=6&aya=54`,
        },
    },
    {
        content: `
        وَمَن تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّـهِ مَتَابًا
        `,
        sora: "الفرقان",
        ayah: "71",
        tafseer: {
            content: `وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا أي: فليعلم أن توبته في غاية الكمال لأنها رجوع إلى الطريق الموصل إلى الله الذي هو عين سعادة العبد وفلاحه فليخلص فيها وليخلصها من شوائب الأغراض الفاسدة، فالمقصود من هذا الحث على تكميل التوبة وإيقاعها على أفضل الوجوه وأجلها ليقدم على من تاب إليه فيوفيه أجره بحسب كمالها.`,
            source: `https://surahquran.com/Explanation.php?sora=25&aya=71`,
        },
    },
    {
        content: `
        وَإِنّي لَغَفّارٌ لِمَن تابَ وَآمَنَ وَعَمِلَ صالِحًا ثُمَّ اهتَدى
        `,
        sora: "طه",
        ayah: "82",
        tafseer: {
            content: `ومع هذا، فالتوبة معروضة، ولو عمل العبد ما عمل من المعاصي، فلهذا قال: وَإِنِّي لَغَفَّارٌ أي: كثير المغفرة والرحمة، لمن تاب من الكفر والبدعة والفسوق، وآمن بالله وملائكته وكتبه ورسله واليوم الآخر، وعمل صالحا من أعمال القلب والبدن، وأقوال اللسان.
            ثُمَّ اهْتَدَى أي: سلك الصراط المستقيم، وتابع الرسول الكريم، واقتدى بالدين القويم، فهذا يغفر الله أوزاره، ويعفو عما تقدم من ذنبه وإصراره، لأنه أتى بالسبب الأكبر، للمغفرة والرحمة، بل الأسباب كلها منحصرة في هذه الأشياء فإن التوبة تجب ما قبلها، والإيمان والإسلام يهدم ما قبله، والعمل الصالح الذي هو الحسنات، يذهب السيئات، وسلوك طرق الهداية بجميع أنواعها، من تعلم علم، وتدبر آية أو حديث، حتى يتبين له معنى من المعاني يهتدي به، ودعوة إلى دين الحق، ورد بدعة أو كفر أو ضلالة، وجهاد، وهجرة، وغير ذلك من جزئيات الهداية، كلها مكفرات للذنوب محصلات لغاية المطلوب.`,
            source: `https://surahquran.com/Explanation.php?sora=20&aya=82`,
        },
    },
    {
        content: `
        وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاء وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُم بِآيَاتِنَا يُؤْمِنُونَ
        `,
        sora: "الأعراف",
        ayah: "156",
        tafseer: {
            content: `وقال موسى في تمام دعائه وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً من علم نافع، ورزق واسع، وعمل صالح.
            وَفِي الآخِرَةِ حَسَنَةً :وهي ما أعد اللّه لأوليائه الصالحين من الثواب.
            إِنَّا هُدْنَا إِلَيْكَ أي: رجعنا مقرين بتقصيرنا، منيبين في جميع أمورنا.
            قَالَ اللّه تعالى عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاءُ ممن كان شقيا، متعرضا لأسبابه، وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ من العالم العلوي والسفلي، البر والفاجر، المؤمن والكافر، فلا مخلوق إلا وقد وصلت إليه رحمة اللّه، وغمره فضله وإحسانه، ولكن الرحمة الخاصة المقتضية لسعادة الدنيا والآخرة، ليست لكل أحد، ولهذا قال عنها: فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ المعاصي، صغارها وكبارها.
            وَيُؤْتُونَ الزَّكَاةَ الواجبة مستحقيها وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ ومن تمام الإيمان بآيات اللّه معرفة معناها، والعمل بمقتضاها، ومن ذلك اتباع النبي صلى الله عليه وسلم ظاهرا وباطنا، في أصول الدين وفروعه.`,
            source: `https://surahquran.com/Explanation.php?sora=7&aya=156`,
        },
    },
    {
        content: `
        مَن جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ
        `,
        sora: "القصص",
        ayah: "84",
        tafseer: {
            content: `يخبر تعالى عن مضاعفة فضله، وتمام عدله فقال: مَنْ جَاءَ بِالْحَسَنَةِ شرط فيها أن يأتي بها العامل، لأنه قد يعملها، ولكن يقترن بها ما لا تقبل منه أو يبطلها، فهذا لم يجيء بالحسنة، والحسنة: اسم جنس يشمل جميع ما أمر اللّه به ورسوله، من الأقوال والأعمال الظاهرة والباطنة، المتعلقة بحق الله تعالى وحق عباده، فَلَهُ خَيْرٌ مِنْهَا [أي: أعظم وأجل، وفي الآية الأخرى فَلَهُ عَشْرُ أَمْثَالِهَا ]هذا التضعيف للحسنة، لا بد منه، وقد يقترن بذلك من الأسباب ما تزيد به المضاعفة، كما قال تعالى: وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ بحسب حال العامل وعمله، ونفعه ومحله ومكانه، وَمَنْ جَاءَ بِالسَّيِّئَةِ وهي كل ما نهى الشارع عنه، نَهْيَ تحريم.
            فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ كقوله تعالى: مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُونَ`,
            source: `https://surahquran.com/Explanation.php?sora=28&aya=84`,
        },
    },
    {
        content: `
        أَلَم يَعلَموا أَنَّ اللَّـهَ هُوَ يَقبَلُ التَّوبَةَ عَن عِبادِهِ وَيَأخُذُ الصَّدَقاتِ وَأَنَّ اللَّـهَ هُوَ التَّوّابُ الرَّحيمُ
        `,
        sora: "التوبه",
        ayah: "104",
        tafseer: {
            content: `ي أما علموا سعة رحمة اللّه وعموم كرمه وأنه‏يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ التائبين من أي ذنب كان، بل يفرح تعالى بتوبة عبده، إذا تاب أعظم فرح .
        ‏وَيَأْخُذُ الصَّدَقَاتِ‏‏ منهم أي‏:‏ يقبلها، ويأخذها بيمينه، فيربيها لأحدهم كما يربي الرجل فلوه، حتى تكون التمرة الواحدة كالجبل العظيم، فكيف بما هو أكبر وأكثر من ذلك‏.
            ‏وَأَنَّ اللَّهَ هُوَ التَّوَّابُ‏‏ أي‏:‏ كثير التوبة على التائبين، فمن تاب إليه تاب عليه، ولو تكررت منه لمعصية مرارا.
            ‏ ولا يمل اللّه من التوبة على عباده، حتى يملوا هم، ويأبوا إلا النفار والشرود عن بابه، وموالاتهم .
            ‏‏‏الرَّحِيمِ‏‏ الذي وسعت رحمته كل شيء، وكتبها للذين يتقون، ويؤتون الزكاة، ويؤمنون بآياته، ويتبعون .`,
            source: `https://surahquran.com/Explanation.php?sora=9&aya=104`,
        },
    },
    {
        content: `
        وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّـهَ يَجِدِ اللَّـهَ غَفُورًا رَّحِيمًا
        `,
        sora: "النساء",
        ayah: "110",
        tafseer: {
            content: ` ومن يعمل سوءا ) يعني السرقة ، ( أو يظلم نفسه ) برميه البريء ، وقيل: ومن يعمل سوءا أي : شركا أو يظلم نفسه : يعني : إثما دون الشرك ، ( ثم يستغفر الله ) أي : يتب إليه ويستغفره ، ( يجد الله غفورا رحيما ) يعرض التوبة على طعمة في هذه الآية .`,
            source: `https://surahquran.com/Explanation.php?sora=4&aya=110`,
        },
    },
    {
        content: `
        قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ
        `,
        sora: "آل عمران",
        ayah: "31",
        tafseer: {
            content: `وهذه الآية فيها وجوب محبة الله، وعلاماتها، ونتيجتها، وثمراتها، فقال قل إن كنتم تحبون الله أي: ادعيتم هذه المرتبة العالية، والرتبة التي ليس فوقها رتبة فلا يكفي فيها مجرد الدعوى، بل لابد من الصدق فيها، وعلامة الصدق اتباع رسوله صلى الله عليه وسلم في جميع أحواله، في أقواله وأفعاله، في أصول الدين وفروعه، في الظاهر والباطن، فمن اتبع الرسول دل على صدق دعواه محبة الله تعالى، وأحبه الله وغفر له ذنبه، ورحمه وسدده في جميع حركاته وسكناته، ومن لم يتبع الرسول فليس محبا لله تعالى، لأن محبته لله توجب له اتباع رسوله، فما لم يوجد ذلك دل على عدمها وأنه كاذب إن ادعاها، مع أنها على تقدير وجودها غير نافعة بدون شرطها، وبهذه الآية يوزن جميع الخلق، فعلى حسب حظهم من اتباع الرسول يكون إيمانهم وحبهم لله، وما نقص من ذلك نقص.`,
            source: `https://surahquran.com/Explanation.php?sora=3&aya=31`,
        },
    },
    {
        content: `
        وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا
        `,
        sora: "الإسراء",
        ayah: "29",
        tafseer: {
            content: `وقال هنا: وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ كناية عن شدة الإمساك والبخل.
            وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فتنفق فيما لا ينبغي، أو زيادة على ما ينبغي.
            فَتَقْعُدَ إن فعلت ذلك مَلُومًا أي: تلام على ما فعلت مَحْسُورًا أي: حاسر اليد فارغها فلا بقي ما في يدك من المال ولا خلفه مدح وثناء.`,
            source: `https://surahquran.com/Explanation.php?sora=17&aya=29`,
        },
    },
    {
        content: `
        فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ
        `,
        sora: "القصص",
        ayah: "24",
        tafseer: {
            content: `فرق لهما موسى عليه السلام ورحمهما فَسَقَى لَهُمَا غير طالب منهما الأجرة، ولا له قصد غير وجه اللّه تعالى، فلما سقى لهما، وكان ذلك وقت شدة حر، وسط النهار، بدليل قوله: ثُمَّ تَوَلَّى إِلَى الظِّلِّ مستريحا لذلك الظلال بعد التعب.
فَقَالَ في تلك الحالة، مسترزقا ربه رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ أي: إني مفتقر للخير الذي تسوقه إليَّ وتيسره لي.
وهذا سؤال منه بحاله، والسؤال بالحال أبلغ من السؤال بلسان المقال، فلم يزل في هذه الحالة داعيا ربه متملقا.
وأما المرأتان، فذهبتا إلى أبيهما، وأخبرتاه بما جرى.`,
            source: `https://surahquran.com/Explanation.php?sora=28&aya=24`,
        },
    },
    {
        content: ` يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ`,
        sora: `يوسف`,
        ayah: "87",
        tafseer: {
            content: `أي: قال يعقوب عليه السلام لبنيه: يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ أي: احرصوا واجتهدوا على التفتيش عنهما وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ فإن الرجاء يوجب للعبد السعي والاجتهاد فيما رجاه، والإياس: يوجب له التثاقل والتباطؤ، وأولى ما رجا العباد، فضل الله وإحسانه ورحمته وروحه، إِنَّهُ لَا يَيْئَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ فإنهم لكفرهم يستبعدون رحمته، ورحمته بعيدة منهم، فلا تتشبهوا بالكافرين.`,
            source: `https://surahquran.com/Explanation.php?sora=12&aya=87`,
        },
    },
    {
        content: `
        يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ إِنَّ اللَّـهَ مَعَ الصَّابِرِينَ
        `,
        sora: `البقرة`,
        ayah: "153",
        tafseer: {
            content: `أمر الله تعالى المؤمنين, بالاستعانة على أمورهم الدينية والدنيوية بِالصَّبْرِ وَالصَّلَاةِ فالصبر هو: حبس النفس وكفها عما تكره, فهو ثلاثة أقسام: صبرها على طاعة الله حتى تؤديها, وعن معصية الله حتى تتركها, وعلى أقدار الله المؤلمة فلا تتسخطها، فالصبر هو المعونة العظيمة على كل أمر, فلا سبيل لغير الصابر, أن يدرك مطلوبه، خصوصا الطاعات الشاقة المستمرة, فإنها مفتقرة أشد الافتقار, إلى تحمل الصبر, وتجرع المرارة الشاقة، فإذا لازم صاحبها الصبر, فاز بالنجاح, وإن رده المكروه والمشقة عن الصبر والملازمة عليها, لم يدرك شيئا, وحصل على الحرمان، وكذلك المعصية التي تشتد دواعي النفس ونوازعها إليها وهي في محل قدرة العبد، فهذه لا يمكن تركها إلا بصبر عظيم, وكف لدواعي قلبه ونوازعها لله تعالى, واستعانة بالله على العصمة منها, فإنها من الفتن الكبار.
وكذلك البلاء الشاق, خصوصا إن استمر, فهذا تضعف معه القوى النفسانية والجسدية, ويوجد مقتضاها, وهو التسخط, إن لم يقاومها صاحبها بالصبر لله, والتوكل عليه, واللجأ إليه, والافتقار على الدوام.
فعلمت أن الصبر محتاج إليه العبد, بل مضطر إليه في كل حالة من أحواله، فلهذا أمر الله تعالى به, وأخبر أنه مَعَ الصَّابِرِينَ - أي: مع من كان الصبر لهم خلقا, وصفة, وملكة بمعونته وتوفيقه, وتسديده، فهانت عليهم بذلك, المشاق والمكاره, وسهل عليهم كل عظيم, وزالت عنهم كل صعوبة، وهذه معية خاصة, تقتضي محبته ومعونته, ونصره وقربه, وهذه [منقبة عظيمة] للصابرين، فلو لم يكن للصابرين فضيلة إلا أنهم فازوا بهذه المعية من الله, لكفى بها فضلا وشرفا، وأما المعية العامة, فهي معية العلم والقدرة, كما في قوله تعالى: وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ وهذه عامة للخلق.
وأمر تعالى بالاستعانة بالصلاة لأن الصلاة هي عماد الدين, ونور المؤمنين, وهي الصلة بين العبد وبين ربه، فإذا كانت صلاة العبد صلاة كاملة, مجتمعا فيها ما يلزم فيها, وما يسن, وحصل فيها حضور القلب, الذي هو لبها فصار العبد إذا دخل فيها, استشعر دخوله على ربه, ووقوفه بين يديه, موقف العبد الخادم المتأدب, مستحضرا لكل ما يقوله وما يفعله, مستغرقا بمناجاة ربه ودعائه لا جرم أن هذه الصلاة, من أكبر المعونة على جميع الأمور فإن الصلاة تنهى عن الفحشاء والمنكر، ولأن هذا الحضور الذي يكون في الصلاة, يوجب للعبد في قلبه, وصفا, وداعيا يدعوه إلى امتثال أوامر ربه, واجتناب نواهيه، هذه هي الصلاة التي أمر الله أن نستعين بها على كل شيء.`,
            source: `https://surahquran.com/Explanation.php?sora=2&aya=153`,
        },
    },
    {
        content: `قَالُوا أَإِنَّكَ لَأَنْتَ يُوسُفُ ۖ قَالَ أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا ۖ إِنَّهُ مَنْ يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ`,
        sora: `يوسف`,
        ayah: "90",
        tafseer: {
            content: `فعرفوا أن الذي خاطبهم هو يوسف، فقالوا: أَئِنَّكَ لَأَنْتَ يُوسُفُ قَالَ أَنَا يُوسُفُ وَهَذَا أَخِي قَدْ مَنَّ اللَّهُ عَلَيْنَا بالإيمان والتقوى والتمكين في الدنيا، وذلك بسبب الصبر والتقوى، إِنَّهُ مَنْ يَتَّقِ وَيَصْبِرْ أي: يتقي فعل ما حرم الله، ويصبر على الآلام والمصائب، وعلى الأوامر بامتثالها فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ فإن هذا من الإحسان، والله لا يضيع أجر من أحسن عملا.`,
            source: `https://surahquran.com/Explanation.php?sora=12&aya=90`,
        },
    },
    {
        content: `لَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ * الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّـهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ * أُولَـئكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولـئِكَ هُمُ الْمُهْتَدُونَ`,
        sora: `البقرة`,
        ayah: "157-155",
        tafseer: {
            content: `أخبر تعالى أنه لا بد أن يبتلي عباده بالمحن، ليتبين الصادق من الكاذب، والجازع من الصابر، وهذه سنته تعالى في عباده؛ لأن السراء لو استمرت لأهل الإيمان، ولم يحصل معها محنة، لحصل الاختلاط الذي هو فساد، وحكمة الله تقتضي تمييز أهل الخير من أهل الشر.
هذه فائدة المحن، لا إزالة ما مع المؤمنين من الإيمان، ولا ردهم عن دينهم، فما كان الله ليضيع إيمان المؤمنين، فأخبر في هذه الآية أنه سيبتلي عباده {بِشَيْءٍ مِنَ الْخَوْفِ} من الأعداء {وَالْجُوعِ} أي: بشيء يسير منهما؛ لأنه لو ابتلاهم بالخوف كله، أو الجوع، لهلكوا، والمحن تمحص لا تهلك.

{وَنَقْصٍ مِنَ الأمْوَالِ} وهذا يشمل جميع النقص المعتري للأموال من جوائح سماوية، وغرق، وضياع، وأخذ الظلمة للأموال من الملوك الظلمة، وقطاع الطريق وغير ذلك.

{وَالأنْفُسِ} أي: ذهاب الأحباب من الأولاد، والأقارب، والأصحاب، ومن أنواع الأمراض في بدن العبد، أو بدن من يحبه، {وَالثَّمَرَاتِ} أي: الحبوب، وثمار النخيل، والأشجار كلها، والخضر ببرد، أو برد، أو حرق، أو آفة سماوية، من جراد ونحوه.

فهذه الأمور، لا بد أن تقع، لأن العليم الخبير، أخبر بها، فوقعت كما أخبر، فإذا وقعت انقسم الناس قسمين: جازعين وصابرين، فالجازع، حصلت له المصيبتان، فوات المحبوب، وهو وجود هذه المصيبة، وفوات ما هو أعظم منها، وهو الأجر بامتثال أمر الله بالصبر، ففاز بالخسارة والحرمان، ونقص ما معه من الإيمان، وفاته الصبر والرضا والشكران، وحصل [له] السخط الدال على شدة النقصان.

وأما من وفقه الله للصبر عند وجود هذه المصائب، فحبس نفسه عن التسخط، قولا وفعلا واحتسب أجرها عند الله، وعلم أن ما يدركه من الأجر بصبره أعظم من المصيبة التي حصلت له، بل المصيبة تكون نعمة في حقه، لأنها صارت طريقا لحصول ما هو خير له وأنفع منها، فقد امتثل أمر الله، وفاز بالثواب، فلهذا قال تعالى: {وَبَشِّرِ الصَّابِرِينَ} أي: بشرهم بأنهم يوفون أجرهم بغير حساب.

فالصابرين، هم الذين فازوا بالبشارة العظيمة، والمنحة الجسيمة، ثم وصفهم بقوله: {الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ} وهي كل ما يؤلم القلب أو البدن أو كليهما مما تقدم ذكره.

{قَالُوا إِنَّا لِلَّهِ} أي: مملوكون لله، مدبرون تحت أمره وتصريفه، فليس لنا من أنفسنا وأموالنا شيء، فإذا ابتلانا بشيء منها، فقد تصرف أرحم الراحمين، بمماليكه وأموالهم، فلا اعتراض عليه، بل من كمال عبودية العبد، علمه، بأن وقوع البلية من المالك الحكيم، الذي أرحم بعبده من نفسه، فيوجب له ذلك، الرضا عن الله، والشكر له على تدبيره، لما هو خير لعبده، وإن لم يشعر بذلك، ومع أننا مملوكون لله، فإنا إليه راجعون يوم المعاد، فمجاز كل عامل بعمله، فإن صبرنا واحتسبنا وجدنا أجرنا موفورا عنده، وإن جزعنا وسخطنا، لم يكن حظنا إلا السخط وفوات الأجر، فكون العبد لله، وراجع إليه، من أقوى أسباب الصبر.
{أُولَئِكَ} الموصوفون بالصبر المذكور {عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ} أي: ثناء وتنويه بحالهم {وَرَحْمَةٌ} عظيمة، ومن رحمته إياهم، أن وفقهم للصبر الذي ينالون به كمال الأجر، {وَأُولَئِكَ هُمُ الْمُهْتَدُونَ} الذين عرفوا الحق، وهو في هذا الموضع، علمهم بأنهم لله، وأنهم إليه راجعون، وعملوا به وهو هنا صبرهم لله.

ودلت هذه الآية، على أن من لم يصبر، فله ضد ما لهم، فحصل له الذم من الله، والعقوبة، والضلال والخسار، فما أعظم الفرق بين الفريقين وما أقل تعب الصابرين، وأعظم عناء الجازعين، فقد اشتملت هاتان الآيتان على توطين النفوس على المصائب قبل وقوعها، لتخف وتسهل، إذا وقعت، وبيان ما تقابل به، إذا وقعت، وهو الصبر، وبيان ما يعين على الصبر، وما للصابر من الأجر، ويعلم حال غير الصابر، بضد حال الصابر.

وأن هذا الابتلاء والامتحان، سنة الله التي قد خلت، ولن تجد لسنة الله تبديلا وبيان أنواع المصائب.`,
            source: `https://www.yanbuweather.com/tafsir/index.php?surah=2&ayah=155&book=9`,
        },
    },
    {
        content: `قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَـذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّـهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ`,
        sora: `الزمر`,
        ayah: "10",
        tafseer: {
            content: `قول تعالى آمرا عباده المؤمنين بالاستمرار على طاعته وتقواه ( قل يا عباد الذين آمنوا اتقوا ربكم للذين أحسنوا في هذه الدنيا حسنة ) أي : لمن أحسن العمل في هذه الدنيا حسنة في دنياهم وأخراهم .وقوله : ( وأرض الله واسعة ) قال مجاهد : فهاجروا فيها ، وجاهدوا ، واعتزلوا الأوثان .وقال شريك ، عن منصور ، عن عطاء في قوله : ( وأرض الله واسعة ) قال : إذا دعيتم إلى المعصية فاهربوا ، ثم قرأ : ( ألم تكن أرض الله واسعة فتهاجروا فيها ) [ النساء : 97 ] .وقوله : ( إنما يوفى الصابرون أجرهم بغير حساب ) قال الأوزاعي : ليس يوزن لهم ولا يكال ، إنما يغرف لهم غرفا .وقال ابن جريج : بلغني أنه لا يحسب عليهم ثواب عملهم قط ، ولكن يزادون على ذلك .وقال السدي : ( إنما يوفى الصابرون أجرهم بغير حساب ) يعني : في الجنة .`,
            source: `https://surahquran.com/Explanation.php?sora=39&aya=10`,
        },
    },
    {
        content: `اللَّـهُ الَّذي رَفَعَ السَّماواتِ بِغَيرِ عَمَدٍ تَرَونَها ثُمَّ استَوى عَلَى العَرشِ وَسَخَّرَ الشَّمسَ وَالقَمَرَ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى يُدَبِّرُ الأَمرَ يُفَصِّلُ الآياتِ لَعَلَّكُم بِلِقاءِ رَبِّكُم توقِنونَ`,
        sora: `الرعد`,
        ayah: "2",
        tafseer: {
            content: `يخبر تعالى عن انفراده بالخلق والتدبير، والعظمة والسلطان الدال على أنه وحده المعبود الذي لا تنبغي العبادة إلا له فقال: اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ على عظمها واتساعها بقدرته العظيمة، بِغَيْرِ عَمَدٍ تَرَوْنَهَا أي: ليس لها عمد من تحتها، فإنه لو كان لها عمد، لرأيتموها ثُمَّ بعد ما خلق السماوات والأرض اسْتَوَى عَلَى الْعَرْشِ العظيم الذي هو أعلى المخلوقات، استواء يليق بجلاله ويناسب كماله.
وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ لمصالح العباد ومصالح مواشيهم وثمارهم، كُلِّ من الشمس والقمر يَجْرِي بتدبير العزيز العليم، لأَجَلٍ مُسَمًّى بسير منتظم، لا يفتران ولا ينيان، حتى يجيء الأجل المسمى وهو طي الله هذا العالم، ونقلهم إلى الدار الآخرة التي هي دار القرار، فعند ذلك يطوي الله السماوات ويبدلها، ويغير الأرض ويبدلها.
فتكور الشمس والقمر، ويجمع بينهما فيلقيان في النار، ليرى من عبدهما أنهما غير أهل للعبادة؛ فيتحسر بذلك أشد الحسرة وليعلم الذين كفروا أنهم كانوا كاذبين.
وقوله يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ هذا جمع بين الخلق والأمر، أي: قد استوى الله العظيم على سرير الملك، يدبر الأمور في العالم العلوي والسفلي، فيخلق ويرزق، ويغني ويفقر، ويرفع أقواما ويضع آخرين، ويعز ويذل، ويخفض ويرفع، ويقيل العثرات، ويفرج الكربات، وينفذ الأقدار في أوقاتها التي سبق بها علمه، وجرى بها قلمه، ويرسل ملائكته الكرام لتدبير ما جعلهم على تدبيره.
وينزل الكتب الإلهية على رسله ويبين ما يحتاج إليه العباد من الشرائع والأوامر والنواهي، ويفصلها غاية التفصيل ببيانها وإيضاحها وتمييزها، لَعَلَّكُمْ بسبب ما أخرج لكم من الآيات الأفقية والآيات القرآنية، بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ فإن كثرة الأدلة وبيانها ووضوحها، من أسباب حصول اليقين في جميع الأمور الإلهية، خصوصا في العقائد الكبار، كالبعث والنشور والإخراج من القبور.
وأيضا فقد علم أن الله تعالى حكيم لا يخلق الخلق سدى، ولا يتركهم عبثا، فكما أنه أرسل رسله وأنزل كتبه لأمر العباد ونهيهم، فلا بد أن ينقلهم إلى دار يحل فيها جزاؤه، فيجازي المحسنين بأحسن الجزاء، ويجازي المسيئين بإساءتهم.`,
            source: `https://surahquran.com/Explanation.php?sora=13&aya=2`,
        },
    },
    {
        content: `وَهُوَ الَّذي أَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ نَباتَ كُلِّ شَيءٍ فَأَخرَجنا مِنهُ خَضِرًا نُخرِجُ مِنهُ حَبًّا مُتَراكِبًا وَمِنَ النَّخلِ مِن طَلعِها قِنوانٌ دانِيَةٌ وَجَنّاتٍ مِن أَعنابٍ وَالزَّيتونَ وَالرُّمّانَ مُشتَبِهًا وَغَيرَ مُتَشابِهٍ انظُروا إِلى ثَمَرِهِ إِذا أَثمَرَ وَيَنعِهِ إِنَّ في ذلِكُم لَآياتٍ لِقَومٍ يُؤمِنونَ`,
        sora: `الأنعام`,
        ayah: "99",
        tafseer: {
            content: `وهذا من أعظم مننه العظيمة، التي يضطر إليها الخلق، من الآدميين وغيرهم، وهو أنه أنزل من السماء ماء متتابعا وقت حاجة الناس إليه، فأنبت الله به كل شيء، مما يأكل الناس والأنعام، فرتع الخلق بفضل الله، وانبسطوا برزقه، وفرحوا بإحسانه، وزال عنهم الجدب واليأس والقحط، ففرحت القلوب، وأسفرت الوجوه، وحصل للعباد من رحمة الرحمن الرحيم، ما به يتمتعون وبه يرتعون، مما يوجب لهم، أن يبذلوا جهدهم في شكر من أسدى النعم، وعبادته والإنابة إليه، والمحبة له.
ولما ذكر عموم ما ينبت بالماء، من أنواع الأشجار والنبات، ذكر الزرع والنخل، لكثرة نفعهما وكونهما قوتا لأكثر الناس فقال: فَأَخْرَجْنَا مِنْهُ خَضِرًا نُخْرِجُ مِنْهُ أي: من ذلك النبات الخضر، حَبًّا مُتَرَاكِبًا بعضه فوق بعض، من بر، وشعير، وذرة، وأرز، وغير ذلك، من أصناف الزروع، وفي وصفه بأنه متراكب، إشارة إلى أن حبوبه متعددة، وجميعها تستمد من مادة واحدة، وهي لا تختلط، بل هي متفرقة الحبوب، مجتمعة الأصول، وإشارة أيضا إلى كثرتها، وشمول ريعها وغلتها، ليبقى أصل البذر، ويبقى بقية كثيرة للأكل والادخار.
وَمِنَ النَّخْلِ أخرج الله مِنْ طَلْعِهَا وهو الكفرى، والوعاء قبل ظهور القنو منه، فيخرج من ذلك الوعاء قِنْوَانٌ دَانِيَةٌ أي: قريبة سهلة التناول، متدلية على من أرادها، بحيث لا يعسر التناول من النخل وإن طالت، فإنه يوجد فيها كرب ومراقي، يسهل صعودها.
و أخرج تعالى بالماء جنات مِنْ أَعْنَابٍ وَالزَّيْتُونَ وَالرُّمَّانَ فهذه من الأشجار الكثيرة النفع، العظيمة الوقع، فلذلك خصصها الله بالذكر بعد أن عم جميع الأشجار والنوابت.
وقوله مُشْتَبِهًا وَغَيْرَ مُتَشَابِهٍ يحتمل أن يرجع إلى الرمان والزيتون، أي: مشتبها في شجره وورقه، غير متشابه في ثمره.
ويحتمل أن يرجع ذلك، إلى سائر الأشجار والفواكه، وأن بعضها مشتبه، يشبه بعضه بعضا، ويتقارب في بعض أوصافه، وبعضها لا مشابهة بينه وبين غيره، والكل ينتفع به العباد، ويتفكهون، ويقتاتون، ويعتبرون، ولهذا أمر تعالى بالاعتبار به، فقال: انْظُرُوا نظر فكر واعتبار إِلَى ثَمَرِهِ أي: الأشجار كلها، خصوصا: النخل إذا أثمر وَيَنْعِهِ أي: انظروا إليه، وقت إطلاعه، ووقت نضجه وإيناعه، فإن في ذلك عبرا وآيات، يستدل بها على رحمة الله، وسعة إحسانه وجوده، وكمال اقتداره وعنايته بعباده.
ولكن ليس كل أحد يعتبر ويتفكر وليس كل من تفكر، أدرك المعنى المقصود، ولهذا قيد تعالى الانتفاع بالآيات بالمؤمنين فقال: إِنَّ فِي ذَلِكَم لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ فإن المؤمنين يحملهم ما معهم من الإيمان، على العمل بمقتضياته ولوازمه، التي منها التفكر في آيات الله، والاستنتاج منها ما يراد منها، وما تدل عليه، عقلا، وفطرة، وشرعا.`,
            source: `https://surahquran.com/Explanation.php?sora=6&aya=99`,
        },
    },
    {
        content: `اللَّـهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّـهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّـهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا`,
        sora: `الطلاق`,
        ayah: "12",
        tafseer: {
            content: ` أخبر [تعالى] أنه خلق الخلق من السماوات السبع ومن فيهن والأرضين السبع ومن فيهن، وما بينهن، وأنزل الأمر، وهو الشرائع والأحكام الدينية التي أوحاها إلى رسله لتذكير العباد ووعظهم، وكذلك الأوامر الكونية والقدرية التي يدبر بها الخلق، كل ذلك لأجل أن يعرفه العباد ويعلموا إحاطة قدرته بالأشياء كلها، وإحاطة علمه بجميع الأشياء فإذا عرفوه بأوصافه المقدسة وأسمائه الحسنى وعبدوه وأحبوه وقاموا بحقه، فهذه الغاية المقصودة من الخلق والأمر معرفة الله وعبادته، فقام بذلك الموفقون من عباد الله الصالحين، وأعرض عن ذلك، الظالمون المعرضون.
`,
            source: `https://surahquran.com/Explanation-aya-12-sora-65.html#:~:text=%D8%AA%D9%81%D8%B3%D9%8A%D8%B1%20%D8%A7%D9%84%D8%A8%D8%BA%D9%88%D9%8A%20%3A%20%D9%85%D8%B6%D9%85%D9%88%D9%86%20%D8%A7%D9%84%D8%A2%D9%8A%D8%A9%2012%20%D9%85%D9%86%20%D8%B3%D9%88%D8%B1%D8%A9%20%D8%A7%D9%84%D8%B7%D9%84%D8%A7%D9%82&text=%D9%88%D9%82%D8%A7%D9%84%20%D9%82%D8%AA%D8%A7%D8%AF%D8%A9%20%3A%20%D9%81%D9%8A%20%D9%83%D9%84%20%D8%A3%D8%B1%D8%B6,%D8%B9%D9%84%D9%85%D8%A7%20)%20%D9%81%D9%84%D8%A7%20%D9%8A%D8%AE%D9%81%D9%89%20%D8%B9%D9%84%D9%8A%D9%87%20%D8%B4%D9%8A%D8%A1%20.`,
        },
    },
    {
        content: `إِنَّ رَبَّكُمُ اللَّـهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ في سِتَّةِ أَيّامٍ ثُمَّ استَوى عَلَى العَرشِ يُغشِي اللَّيلَ النَّهارَ يَطلُبُهُ حَثيثًا وَالشَّمسَ وَالقَمَرَ وَالنُّجومَ مُسَخَّراتٍ بِأَمرِهِ أَلا لَهُ الخَلقُ وَالأَمرُ تَبارَكَ اللَّـهُ رَبُّ العالَمينَ`,
        sora: `الأعراف`,
        ayah: "54",
        tafseer: {
            content: `يقول تعالى مبينا أنه الرب المعبود وحده لا شريك له: إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وما فيهما على عظمهما وسعتهما، وإحكامهما، وإتقانهما، وبديع خلقهما.
فِي سِتَّةِ أَيَّامٍ أولها يوم الأحد، وآخرها يوم الجمعة، فلما قضاهما وأودع فيهما من أمره ما أودع اسْتَوَى تبارك وتعالى عَلَى الْعَرْشِ العظيم الذي يسع السماوات والأرض وما فيهما وما بينهما، استوى استواء يليق بجلاله وعظمته وسلطانه، فاستوى على العرش، واحتوى على الملك، ودبر الممالك، وأجرى عليهم أحكامه الكونية، وأحكامه الدينية، ولهذا قال: يُغْشِي اللَّيْلَ المظلم النَّهَارَ المضيء، فيظلم ما على وجه الأرض، ويسكن الآدميون، وتأوى المخلوقات إلى مساكنها، ويستريحون من التعب، والذهاب والإياب الذي حصل لهم في النهار.
يَطْلُبُهُ حَثِيثًا كلما جاء الليل ذهب النهار، وكلما جاء النهار ذهب الليل، وهكذا أبدا على الدوام، حتى يطوي اللّه هذا العالم، وينتقل العباد إلى دار غير هذه الدار.
وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ أي: بتسخيره وتدبيره، الدال على ما له من أوصاف الكمال، فخلْقُها وعظَمُها دالٌّ على كمال قدرته، وما فيها من الإحكام والانتظام والإتقان دال على كمال حكمته، وما فيها من المنافع والمصالح الضرورية وما دونها دال على سعة رحمته وذلك دال على سعة علمه، وأنه الإله الحق الذي لا تنبغي العبادة إلا له.
أَلَا لَهُ الْخَلْقُ وَالْأَمْرُ أي: له الخلق الذي صدرت عنه جميع المخلوقات علويها وسفليها، أعيانها وأوصافها وأفعالها والأمر المتضمن للشرائع والنبوات، فالخلق: يتضمن أحكامه الكونية القدرية، والأمر: يتضمن أحكامه الدينية الشرعية، وثم أحكام الجزاء، وذلك يكون في دار البقاء، تَبَارَكَ اللَّهُ أي: عظم وتعالى وكثر خيره وإحسانه، فتبارك في نفسه لعظمة أوصافه وكمالها، وبارك في غيره بإحلال الخير الجزيل والبر الكثير، فكل بركة في الكون، فمن آثار رحمته، ولهذا قال: ف تَبَارَكَ اللَّهُ رَبُّ الْعَالَمِينَ ولما ذكر من عظمته وجلاله ما يدل ذوي الألباب على أنه وحده، المعبود المقصود في الحوائج كلها أمر بما يترتب على ذلك، فقال: ادْعُوا رَبَّكُمْ تَضَرُّعًا وَخُفْيَةً إِنَّهُ لا يُحِبُّ الْمُعْتَدِينَ وَلا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلاحِهَا وَادْعُوهُ خَوْفاً وَطَمَعاً إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ`,
            source: `https://surahquran.com/Explanation-aya-54-sora-7.html`,
        },
    },
    {
        content: `إِنَّ لِلْمُتَّقِينَ مَفَازًا * حَدَائِقَ وَأَعْنَابًا * وَكَوَاعِبَ أَتْرَابًا * وَكَأْسًا دِهَاقًا * لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا * جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا`,
        sora: `النبأ`,
        ayah: "36-31",
        tafseer: {
            content: `يقول تعالى مخبراً عن السعداء، وما أعد لهم تعالى من الكرامة والنعيم المقيم، فقال تعالى: {إِنَّ لِلْمُتَّقِينَ مَفَازاً} قال ابن عباس والضحاك: متنزهاً.
وقال مجاهد وقتادة: فازوا فنجوا من النار.
والأظهر ههنا قول ابن عباس؛ لأنه قال بعده {حَدَآئِقَ} والحدائق: البساتين من النخيل وغيرها { وَأَعْنَـٰباً وَكَوَاعِبَ أَتْرَاباً} أي: وحوراً كواعب، قال ابن عباس ومجاهد وغير واحد: {وَكَوَاعِبَ} أي: نواهد، يعنون: أن ثديهن نواهد، لم يتدلين؛ لأنهن أبكار عرب، أتراب أي: في سن واحد؛ كما تقدم بيانه في سورة الواقعة.
قال ابن أبي حاتم: حدثنا عبد الله بن أحمد بن عبد الرحمن الدشتكي، حدثني أبي عن أبي سفيان عبد الرحمن بن عبد الله بن تيم، حدثنا عطية بن سليمان أبو الغيث عن أبي عبد الرحمن القاسم بن أبي القاسم الدمشقي عن أبي أمامة: أنه سمعه يحدث عن النبي صلى الله عليه وسلم أنه قال:
إن قمص أهل الجنة لتبدو من رضوان الله، وإن السحابة لتمر بهم فتناديهم: يا أهل الجنة ماذا تريدون أن أمطركم؟ حتى إنها لتمطرهم الكواعب الأتراب
وقوله تعالى: {وَكَأْساً دِهَاقاً} قال ابن عباس: مملوءة ومتتابعة.
وقال عكرمة: صافية، وقال مجاهد والحسن وقتادة وابن زيد: {دِهَاقاً}: الملأى المترعة، وقال مجاهد وسعيد بن جبير: هي المتتابعة.
وقوله تعالى: {لاَّ يَسْمَعُونَ فِيهَا لَغْواً وَلاَ كِذَٰباً} كقوله:
{لاَّ لَغْوٌ فِيهَا وَلاَ تَأْثِيمٌ}
[الطور: 23] أي: ليس فيها كلام لاغ عار عن الفائدة، ولا إثم كذب، بل هي دار السلام، وكل ما فيها سالم من النقص.
وقوله: {جَزَآءً مِّن رَّبِّكَ عَطَآءً حِسَاباً} أي: هذا الذي ذكرناه جازاهم الله به وأعطاهموه بفضله ومنه وإحسانه.
ورحمته عطاء حساباً، أي: كافياً وافياً شاملاً كثيراً، تقول العرب: أعطاني فأحسبني، أي: كفاني، ومنه: حسبي الله، أي: الله كافيّ.`,
            source: `https://www.yanbuweather.com/tafsir/index.php?surah=78&ayah=31&book=3`,
        },
    },
    {
        content: `إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا وَلِبَاسُهُمْ فِيهَا حَرِيرٌ * وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَى صِرَاطِ الْحَمِيدِ`,
        sora: `الحج`,
        ayah: "24-23",
        tafseer: {
            content: `لما أخبر تعالى عن حال أهل النار، عياذاً بالله من حالهم، وما هم فيه من العذاب والنكال، والحريق والأغلال، وما أعد لهم من الثياب من النار، ذكر حال أهل الجنة، نسأل الله من فضله وكرمه أن يدخلنا الجنة، فقال: {إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّـٰلِحَـٰتِ جَنَـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلأَنْهَـٰرُ} أي: تتخرق في أكنافها وأرجائها وجوانبها وتحت أشجارها وقصورها، يصرفونها حيث شاؤوا، وأين أرادوا {يُحَلَّوْنَ فِيهَا} من الحلية {مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤاً} أي: في أيديهم؛ كما قاله النبي صلى الله عليه وسلم في الحديث المتفق عليه:
تبلغ الحلية من المؤمن حيث يبلغ الوضوء

وقال كعب الأحبار: إن في الجنة ملكاً لو شئت أن أسميه لسميته، يصوغ لأهل الجنة الحلي منذ خلقه الله إلى يوم القيامة، لو أبرز قلب منها - أي: سوار منها - لرد شعاع الشمس؛ كما ترد الشمس نور القمر.
وقوله: {وَلِبَاسُهُمْ فِيهَا حَرِيرٌ} في مقابلة ثياب أهل النار التي فصلت لهم، لباس هؤلاء من الحرير {وَهُدُوۤاْ إِلَى ٱلطَّيِّبِ مِنَ ٱلْقَوْلِ} أي: القرآن، وقيل: لا إله إلا الله، وقيل: الأذكار المشروعة {وَهُدُوۤاْ إِلَىٰ صِرَٰطِ ٱلْحَمِيدِ} أي: الطريق المستقيم في الدنيا، وكل هذا لا ينافي ما ذكرناه، والله أعلم.`,
            source: `https://www.yanbuweather.com/tafsir/index.php?surah=22&ayah=23&book=3#:~:text=%D8%AA%D9%81%D8%B3%D9%8A%D8%B1%20%D8%A7%D9%84%D9%82%D8%B1%D8%A2%D9%86%20%D8%A7%D9%84%D9%83%D8%B1%D9%8A%D9%85%20%2D%20%D8%B3%D9%88%D8%B1%D8%A9%20%D8%A7%D9%84%D8%AD%D8%AC,%D8%A7%D9%84%D8%A2%D9%8A%D8%A7%D8%AA%2023%20%2D%2024%20%7C%20%D8%A7%D9%84%D8%AA%D9%81%D8%B3%D9%8A%D8%B1%20%D8%A7%D9%84%D8%B4%D8%A7%D9%85%D9%84&text=%D9%88%D9%82%D8%A7%D9%84%20%D9%83%D8%B9%D8%A8%20%D8%A7%D9%84%D8%A3%D8%AD%D8%A8%D8%A7%D8%B1%3A%20%D8%A5%D9%86%20%D9%81%D9%8A,%D9%83%D9%85%D8%A7%20%D8%AA%D8%B1%D8%AF%20%D8%A7%D9%84%D8%B4%D9%85%D8%B3%20%D9%86%D9%88%D8%B1%20%D8%A7%D9%84%D9%82%D9%85%D8%B1.`,
        },
    },
    {
        content: `وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ * لِسَعْيِهَا رَاضِيَةٌ * فِي جَنَّةٍ عَالِيَةٍ * لَا تَسْمَعُ فِيهَا لَاغِيَةً * فِيهَا عَيْنٌ جَارِيَةٌ * فِيهَا سُرُرٌ مَرْفُوعَةٌ * وَأَكْوَابٌ مَوْضُوعَةٌ * وَنَمَارِقُ مَصْفُوفَةٌ * وَزَرَابِيُّ مَبْثُوثَةٌ`,
        sora: `الغاشية`,
        ayah: "16-8",
        tafseer: {
            content: `لمّا ذكر حال الأشقياء ثنّى بذكر السّعداء؛ فقال: {وجوهٌ يومئذٍ}. أي: يوم القيامة {ناعمةٌ}. أي: يعرف النّعيم فيها، وإنما حصل لها ذلك بسعيها {لِسَعْيِهَا} الذي قدمتهُ في الدنيا منَ الأعمالِ الصالحةِ، والإحسانِ إلى عبادِ اللهِ، {رَاضِيَةً} إذْ وجدتْ ثوابَهُ مدخراً مضاعفاً، فحمدتْ عقباهُ، وحصلَ لها كلُّ مَا تتمناهُ، وذلكَ أنهَا {فِي جَنَّةٍ}  {في جنّةٍ عاليةٍ}. أي: رفيعةٍ بهيّةٍ في الغرفات آمنون{لا تَسْمَعُ فِيهَا} أي: الجنةُ{لاغِيَةً} أي: كلمةَ لغوٍ وباطلٍ، فضلاً عن الكلامِ المحرمِ، بلْ كلامُهُمْ كلامٌ حسنٌ مشتملٌ على ذكرِ اللهِ تعالَى، وذكرِ نعمهِ المتواترةِ عليهمْ، و الآدابِ المستحسنةِ بينَ المتعاشرينَ، الذي يسرُّ القلوبَ، ويشرحُ الصدورَ {فِيهَا عَيْنٌ جَارِيَةٌ}: تَجْرِي مِيَاهُهَا وَتَتَدَفَّقُ بِأَنْوَاعِ الأَشْرِبَةِ المُسْتَلَذَّةِ {فيها سررٌ مرفوعةٌ}. أي: عاليةٌ ناعمةٌ كثيرة الفرش، مرتفعة السّمك، عليها الحور العين. قالوا: فإذا أراد وليّ اللّه أن يجلس على تلك السّرر العالية تواضعت له {وأكوابٌ موضوعةٌ}. يعني أواني الشّرب، معدّةٌ مرصدةٌ لمن أرادها من أربابها {وَنَمَارِقُ مَصْفُوفَةٌ}: وَسَائِدُ مَصْفُوفَةٌ بَعْضُهَا إِلَى بَعْضٍ {وَزَرَابِيُّ مَبْثُوثَةٌ} والزرابيُّ البسطُ الحسانُ، مبثوثةٌ أي: مملوءةٌ بهَا مجالسهمْ منْ كلِّ جانبٍ`,
            source: `https://www.afaqattaiseer.net/vb/showthread.php?t=25700`,
        },
    },
    {
        content: `وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا شَفَـٰعَةࣱ وَلَا یُؤۡخَذُ مِنۡهَا عَدۡلࣱ وَلَا هُمۡ یُنصَرُونَ`,
        sora: `البقرة`,
        ayah: "48",
        tafseer: {
            content: `وَلَا يُقْبَلُ مِنْهَا - أي: النفس, شفاعة لأحد بدون إذن الله ورضاه عن المشفوع له, ولا يرضى من العمل إلا ما أريد به وجهه، وكان على السبيل والسنة، وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ - أي: فداء ولو أن للذين ظلموا ما في الأرض جميعا ومثله معه لافتدوا به من سوء العذاب ولا يقبل منهم ذلك وَلَا هُمْ يُنْصَرُونَ - أي: يدفع عنهم المكروه، فنفى الانتفاع من الخلق بوجه من الوجوه، فقوله: لَا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئًا هذا في تحصيل المنافع، وَلَا هُمْ يُنْصَرُونَ هذا في دفع المضار, فهذا النفي للأمر المستقل به النافع.
ولا يقبل منها شفاعة ولا يؤخذ منها عدل هذا نفي للنفع الذي يطلب ممن يملكه بعوض, كالعدل, أو بغيره, كالشفاعة، فهذا يوجب للعبد أن ينقطع قلبه من التعلق بالمخلوقين, لعلمه أنهم لا يملكون له مثقال ذرة من النفع, وأن يعلقه بالله الذي يجلب المنافع, ويدفع المضار, فيعبده وحده لا شريك له ويستعينه على عبادته.`,
            source: "https://surahquran.com/Explanation.php?sora=2&aya=48",
        },
    },
    {
        content: `فَقُلۡتُ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارࣰا * یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا`,
        sora: `نوح`,
        ayah: "11-10",
        tafseer: {
            content: `فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ أي: اتركوا ما أنتم عليه من الذنوب، واستغفروا الله منها.
إِنَّهُ كَانَ غَفَّارًا كثير المغفرة لمن تاب واستغفر، فرغبهم بمغفرة الذنوب، وما يترتب عليها من حصول الثواب، واندفاع العقاب
ورغبهم أيضا، بخير الدنيا العاجل، فقال: يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا أي: مطرا متتابعا، يروي الشعاب والوهاد، ويحيي البلاد والعباد..`,
            source: `https://surahquran.com/Explanation.php?sora=71&aya=10
            https://surahquran.com/Explanation.php?sora=71&aya=11
            `,
        },
    },
    {
        content: `أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ لَوَجَدُوا۟ فِيهِ ٱخْتِلَٰفًا كَثِيرًا`,
        sora: `النساء`,
        ayah: "82",
        tafseer: {
            content: `قوله تعالى : ( أفلا يتدبرون القرآن ) يعني : أفلا يتفكرون في القرآن ، والتدبر هو النظر في آخر الأمر ، ودبر كل شيء آخره .
( ولو كان من عند غير الله لوجدوا فيه اختلافا كثيرا ) أي تفاوتا وتناقضا كثيرا ، قاله ابن عباس ، وقيل: لوجدوا فيه أي : في الإخبار عن الغيب بما كان وبما يكون اختلافا كثيرا ، أفلا يتفكرون فيه فيعرفوا - بعدم التناقض فيه وصدق ما يخبر - أنه كلام الله تعالى لأن ما لا يكون من عند الله لا يخلو عن تناقض واختلاف .`,
            source: "https://surahquran.com/Explanation.php?sora=4&aya=82",
        },
    },
    {
        content: `وَإِذَا قُرِئَ ٱلْقُرْءَانُ فَٱسْتَمِعُوا۟ لَهُۥ وَأَنصِتُوا۟ لَعَلَّكُمْ تُرْحَمُونَ`,
        sora: `الأعراف`,
        ayah: "204",
        tafseer: {
            content: `هذا الأمر عام في كل من سمع كتاب اللّه يتلى، فإنه مأمور بالاستماع له والإنصات، والفرق بين الاستماع والإنصات، أن الإنصات في الظاهر بترك التحدث أو الاشتغال بما يشغل عن استماعه.
وأما الاستماع له، فهو أن يلقي سمعه، ويحضر قلبه ويتدبر ما يستمع، فإن من لازم على هذين الأمرين حين يتلى كتاب اللّه، فإنه ينال خيرا كثيرا وعلما غزيرا، وإيمانا مستمرا متجددا، وهدى متزايدا، وبصيرة في دينه، ولهذا رتب اللّه حصول الرحمة عليهما، فدل ذلك على أن من تُلِيَ عليه الكتاب، فلم يستمع له وينصت، أنه محروم الحظ من الرحمة، قد فاته خير كثير.
ومن أوكد ما يؤمر به مستمع القرآن، أن يستمع له وينصت في الصلاة الجهرية إذا قرأ إمامه، فإنه مأمور بالإنصات، حتى إن أكثر العلماء يقولون: إن اشتغاله بالإنصات، أولى من قراءته الفاتحة، وغيرها.`,
            source: "https://surahquran.com/Explanation.php?sora=7&aya=204",
        },
    },
    {
        content: `قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ أَمَّن يَمْلِكُ ٱلسَّمْعَ وَٱلْأَبْصَٰرَ وَمَن يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ وَمَن يُدَبِّرُ ٱلْأَمْرَ فَسَيَقُولُونَ ٱللَّهُ فَقُلْ أَفَلَا تَتَّقُونَ`,
        sora: `يونس`,
        ayah: "31",
        tafseer: {
            content: `قوله تعالى : ( قل من يرزقكم من السماء والأرض ) أي : من السماء بالمطر ، ومن الأرض بالنبات ، ( أمن يملك السمع والأبصار ) أي : من إعطائكم السمع والأبصار ، ( ومن يخرج الحي من الميت ويخرج الميت من الحي ) يخرج الحي من النطفة والنطفة من الحي ، ( ومن يدبر الأمر ) أي : يقضي الأمر ، ( فسيقولون الله ) هو الذي يفعل هذه الأشياء ، ( فقل أفلا تتقون ) أفلا تخافون عقابه في شرككم؟ وقيل: أفلا تتقون الشرك مع هذا الإقرار؟`,
            source: "https://surahquran.com/Explanation.php?sora=10&aya=31",
        },
    },
    {
        content: `إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ`,
        sora: "الحجر",
        ayah: "9",
        tafseer: {
            content: `( إِنَّا نَحْنُ نزلْنَا الذِّكْرَ )- أي: القرآن الذي فيه ذكرى لكل شيء من المسائل والدلائل الواضحة، وفيه يتذكر من أراد التذكر، ( وَإِنَّا لَهُ لَحَافِظُونَ )- أي: في حال إنزاله وبعد إنزاله، ففي حال إنزاله حافظون له من استراق كل شيطان رجيم، وبعد إنزاله أودعه الله في قلب رسوله، واستودعه فيها ثم في قلوب أمته، وحفظ الله ألفاظه من التغيير فيها والزيادة والنقص، ومعانيه من التبديل، فلا يحرف محرف معنى من معانيه إلا وقيض الله له من يبين الحق المبين، وهذا من أعظم آيات الله ونعمه على عباده المؤمنين، ومن حفظه أن الله يحفظ أهله من أعدائهم، ولا يسلط عليهم عدوا يجتاحهم.`,
            source: "https://surahquran.com/aya-tafsir-9-15.html",
        },
    },
    {
        content: `وَمَآ أَنزَلْنَا عَلَيْكَ ٱلْكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِى ٱخْتَلَفُوا۟ فِيهِ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ`,
        sora: "النحل",
        ayah: "64",
        tafseer: {
            content: `وما أنزلنا عليك - أيها الرسول - القرآن إلا لتبين لجميع الناس ما اختلفوا فيه من التوحيد والبعث وأحكام الشرع، وأن يكون القرآن هداية ورحمة للمؤمنين بالله وبرسله، وبما جاء به القرآن، فهم الذين ينتفعون بالحق.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=16&aya=64",
        },
    },
    {
        content: `إِنَّ هَٰذَا ٱلْقُرْءَانَ يَهْدِى لِلَّتِى هِىَ أَقْوَمُ وَيُبَشِّرُ ٱلْمُؤْمِنِينَ ٱلَّذِينَ يَعْمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا`,
        sora: "الإسراء ",
        ayah: "9",
        tafseer: {
            content: `إن هذا القرآن المنزل على محمد صلى الله عليه وسلم يدل على أحسن السُّبُل وهي سبيل الإسلام، ويخبر المؤمنين بالله الذين يعملون الأعمال الصالحات بما يسرهم، وهو أن لهم ثوابًا عظيمًا من الله`,
            source: "https://surahquran.com/aya_tafseer.php?sora=17&aya=9",
        },
    },
    {
        content: `وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِلنَّاسِ مِن كُلِّ مَثَلٍ ۚ وَكَانَ الْإِنسَانُ أَكْثَرَ شَيْءٍ جَدَلًا`,
        sora: "الكهف",
        ayah: "54",
        tafseer: {
            content: `ولقد بيّنا ونوّعنا في هذا القرآن المنزل على محمد صلى الله عليه وسلم الكثير من أنواع الأمثال ليتذكروا ويتّعظوا، لكن الإنسان - وخاصة الكافر - أكثر شيء يظهر منه المجادلة بغير الحق.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=18&aya=54",
        },
    },
    {
        content: `وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِن كِتَابِ رَبِّكَ ۖ لَا مُبَدِّلَ لِكَلِمَاتِهِ وَلَن تَجِدَ مِن دُونِهِ مُلْتَحَدًا`,
        sora: "الكهف",
        ayah: "27",
        tafseer: {
            content: `واقرأ - أيها الرسول - واعمل بما أوحى الله به إليك من القرآن، فلا مبدل لكلماته؛ لأنها صدق كلها وعدل كلها، ولن تجد من دونه سبحانه ملجأً تلجأ إليه، ولا معاذًا تعوذ به سواه.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=18&aya=27",
        },
    },
    {
        content: `وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ٱلْقُرْءَانُ جُمْلَةً وَٰحِدَةً كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَ وَرَتَّلْنَٰهُ تَرْتِيلًا`,
        sora: "الفرقان",
        ayah: "32",
        tafseer: {
            content: `وقال الذين كفروا بالله: هلَّا نُزِّل على الرسول هذا القرآن دفعة واحدة، ولم يُنَزَّل عليه مفرقًا، نزّلنا القرآن كذلك مفرقًا لتثبيت قلبك - أيها الرسول - بنزوله مرة بعد مرة، وأنزلناه شيئًا بعد شيء لتسهيل فهمه وحفظه.`,
            source: "https://surahquran.com/aya_tafseer.php?sora=25&aya=32",
        },
    },
    {
        content: `الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِن فَضْلِهِ ۗ وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُّهِينًا`,
        sora: "النساء",
        ayah: "37",
        tafseer: {
            content: `الَّذِينَ يَبْخَلُونَ أي: يمنعون ما عليهم من الحقوق الواجبة.
وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ بأقوالهم وأفعالهم وَيَكْتُمُونَ مَا آتَاهُمُ اللَّهُ مِنْ فَضْلِهِ أي: من العلم الذي يهتدي به الضالون ويسترشد به الجاهلون فيكتمونه عنهم، ويظهرون لهم من الباطل ما يحول بينهم وبين الحق.
فجمعوا بين البخل بالمال والبخل بالعلم، وبين السعي في خسارة أنفسهم وخسارة غيرهم، وهذه هي صفات الكافرين، فلهذا قال تعالى: وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَابًا مُهِينًا أي: كما تكبروا على عباد الله ومنعوا حقوقه وتسببوا في منع غيرهم من البخل وعدم الاهتداء، أهانهم بالعذاب الأليم والخزي الدائم.
فعياذًا بك اللهم من كل سوء.`,
            source: "https://surahquran.com/Explanation-aya-37-sora-4.html",
        },
    },
    {
        content: `يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ ۚ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ`,
        sora: "التغابن",
        ayah: "4",
        tafseer: {
            content: `يَعْلَمُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ أي: من السرائر والظواهر، والغيب والشهادة.
وَيَعْلَمُ مَا تُسِرُّونَ وَمَا تُعْلِنُونَ وَاللَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ أي: بما فيها من الأسرار الطيبة، والخبايا الخبيثة، والنيات الصالحة، والمقاصد الفاسدة، فإذا كان عليمًا بذات الصدور، تعين على العاقل البصير، أن يحرص ويجتهد في حفظ باطنه، من الأخلاق الرذيلة، واتصافه بالأخلاق الجميلة`,
            source: "https://surahquran.com/Explanation.php?sora=64&aya=4",
        },
    },
    {
        content: `وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ`,
        sora: "الأنبياء",
        ayah: "83",
        tafseer: {
            content: `أي: واذكر عبدنا ورسولنا، أيوب - مثنيا معظما له، رافعا لقدره - حين ابتلاه، ببلاء شديد، فوجده صابرا راضيا عنه، وذلك أن الشيطان سلط على جسده، ابتلاء من الله، وامتحانا فنفخ في جسده، فتقرح قروحا عظيمة ومكث مدة طويلة، واشتد به البلاء، ومات أهله، وذهب ماله، فنادى ربه: رب أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ فتوسل إلى الله بالإخبار عن حال نفسه، وأنه بلغ الضر منه كل مبلغ`,
            source: "https://surahquran.com/Explanation.php?sora=21&aya=83",
        },
    },
    {
        content: `فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ ۖ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَابِدِينَ`,
        sora: "الأنبياء",
        ayah: "84",
        tafseer: {
            content: `وبرحمة ربه الواسعة العامة فاستجاب الله له، وقال له: ارْكُضْ بِرِجْلِكَ هَذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ فركض برجله فخرجت من ركضته عين ماء باردة فاغتسل منها وشرب، فأذهب الله عنه ما به من الأذى، وَآتَيْنَاهُ أَهْلَهُ أي: رددنا عليه أهله وماله.
وَمِثْلَهُمْ مَعَهُمْ بأن منحه الله العافية من الأهل والمال شيئا كثيرا، رَحْمَةً مِنْ عِنْدِنَا به، حيث صبر ورضي، فأثابه الله ثوابا عاجلا قبل ثواب الآخرة.
وَذِكْرَى لِلْعَابِدِينَ أي: جعلناه عبرة للعابدين، الذين ينتفعون بالعبر، فإذا رأوا ما أصابه من البلاء، ثم ما أثابه الله بعد زواله، ونظروا السبب، وجدوه الصبر، ولهذا أثنى الله عليه به في قوله: إِنَّا وَجَدْنَاهُ صَابِرًا نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ فجعلوه أسوة وقدوة عندما يصيبهم الضر.`,
            source: "https://surahquran.com/Explanation.php?sora=21&aya=84",
        },
    },
    {
        content: `وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ`,
        sora: "القمر",
        ayah: "17",
        tafseer: {
            content: `وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ أي: ولقد يسرنا وسهلنا هذا القرآن الكريم، ألفاظه للحفظ والأداء، ومعانيه للفهم والعلم، لأنه أحسن الكلام لفظا، وأصدقه معنى، وأبينه تفسيرا، فكل من أقبل عليه يسر الله عليه مطلوبه غاية التيسير، وسهله عليه، والذكر شامل لكل ما يتذكر به العاملون من الحلال والحرام، وأحكام الأمر والنهي، وأحكام الجزاء والمواعظ والعبر، والعقائد النافعة والأخبار الصادقة، ولهذا كان علم القرآن حفظا وتفسيرا، أسهل العلوم، وأجلها على الإطلاق، وهو العلم النافع الذي إذا طلبه العبد أعين عليه، قال بعض السلف عند هذه الآية: هل من طالب علم فيعان [عليه]؟ ولهذا يدعو الله عباده إلى الإقبال عليه والتذكر بقوله: فَهَلْ مِنْ مُدَّكِرٍ`,
            source: "https://surahquran.com/Explanation.php?sora=54&aya=17",
        },
    },
];

module.exports = verses