const normalizer = {
    'ا': 'ا',
    'أ': 'ا',
    'إ': 'ا',
    'آ': 'ا',
    'ٱ': 'ا',
    'ب': 'ب',
    'ت': 'ت',
    'ث': 'ث',
    'ج': 'ج',
    'ح': 'ح',
    'خ': 'خ',
    'د': 'د',
    'ذ': 'ذ',
    'ر': 'ر',
    'ز': 'ز',
    'س': 'س',
    'ش': 'ش',
    'ص': 'ص',
    'ض': 'ض',
    'ط': 'ط',
    'ظ': 'ظ',
    'ع': 'ع',
    'غ': 'غ',
    'ف': 'ف',
    'ق': 'ق',
    'ك': 'ك',
    'ل': 'ل',
    'م': 'م',
    'ن': 'ن',
    'ه': 'ه',
    'ة': 'ة',
    'و': 'و',
    'ؤ': 'ؤ',
    'ي': 'ي',
    'ى': 'ي',
    'ئ': 'ئ',
    'ءِ': 'ء',
    'ً': '',
    'ٌ': '',
    'ٍ': '',
    'َ': '',
    'ُ': '',
    'ِ': '',
    'ّ': '',
    'ْ': '',
    'ٓ': '',
    'ٔ': '',
    'ٕ': '',
    ' ': ' '
}

function normalizeArabic(text) {
    const normalizedText = Array.from(text).map(letter => normalizer[letter]).join("")

    return normalizedText
}

export default normalizeArabic
