const verses = [
    {
        content: `
        إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا
        `,
        sora: `
        الأحزاب
        `,
        ayah: "56",
        tafseer: {
            content: `
            إن الله تعالى يثني على النبي صلى الله عليه وسلم عند الملائكة المقربين، وملائكته يثنون على النبي ويدعون له، يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، صلُّوا على رسول لله، وسلِّموا تسليمًا، تحية وتعظيمًا له. وصفة الصلاة على النبي صلى الله عليه وسلم ثبتت في السنة على أنواع، منها: "اللهم صلِّ على محمد وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد".
            `,
            source: "https://surahquran.com/aya-56-sora-33.html"
        }
    },
    {
        content: `
        الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ
        `,
        sora: `
        الرعد
        `,
        ayah: "28",
        tafseer : {
            content: `ثم ذكر تعالى علامة المؤمنين فقال: { الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ }- أي: يزول قلقها واضطرابها، وتحضرها أفراحها ولذاتها.{ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ }- أي: حقيق بها وحريٌّ أن لا تطمئن لشيء سوى ذكره، فإنه لا شيء ألذ للقلوب ولا أشهى ولا أحلى من محبة خالقها، والأنس به ومعرفته، وعلى قدر معرفتها بالله ومحبتها له، يكون ذكرها له، هذا على القول بأن ذكر الله، ذكر العبد لربه، من تسبيح وتهليل وتكبير وغير ذلك.وقيل: إن المراد بذكر الله كتابه الذي أنزله ذكرى للمؤمنين، فعلى هذا معنى طمأنينة القلوب بذكر الله: أنها حين تعرف معاني القرآن وأحكامه تطمئن لها،`,
            source: "https://surahquran.com/aya-tafsir-28-13.html#:~:text=%D8%AB%D9%85%20%D8%B0%D9%83%D8%B1%20%D8%AA%D8%B9%D8%A7%D9%84%D9%89%20%D8%B9%D9%84%D8%A7%D9%85%D8%A9%20%D8%A7%D9%84%D9%85%D8%A4%D9%85%D9%86%D9%8A%D9%86,%D9%85%D9%86%20%D9%85%D8%AD%D8%A8%D8%A9%20%D8%AE%D8%A7%D9%84%D9%82%D9%87%D8%A7%D8%8C%20%D9%88%D8%A7%D9%84%D8%A3%D9%86%D8%B3%20%D8%A8%D9%87"
        }
    },
    {
        content: `
        وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "186",
        tafseer: {
            content:`وإذا سألك - أيها النبي - عبادي عن قربي وإجابتي لدعائهم؛ فإني قريب منهم، عالم بأحوالهم، سامع لدعائهم، فلا يحتاجون إلى وسطاء، ولا إلى رفع أصواتهم، أُجيب دعوة الداعي إذا دعاني مخلصًا في دعائه، فلينقادوا لي ولأوامري، وليثبتوا على إيمانهم؛ فإن ذلك أنفع وسيلة لإجابتي، لعلهم يسلكون بذلك سبيل الرشد في شؤونهم الدينية والدنيوية`,
            source:'https://surahquran.com/aya_tafseer.php?sora=2&aya=186'
        }
    },
    {
        content: `
        يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ
        `,
        sora: `
        الحجرات
        `,
        ayah: "13",
        tafseer:{
            content:`يا أيها الناس، إنا خلقناكم من ذكر واحد وهو أبوكم آدم، وأنثى واحدة وهي أمكم حواء، فنسبكم واحد، فلا يفخر بعضكم على بعض في النسب، وصيّرناكم بعد ذلك شعوبًا كثيرة وقبائل منتشرة؛ ليعرف بعضكم بعضًا، لا ليفخر عليه؛ لأن التمايز لا يكون إلا بالتقوى، لذا قال: إن أكرمكم عند الله أتقاكم، إن الله عليم بأحوالكم، خبير بما تكونون عليه من كمال ونقص، لا يخفى عليه شيء من ذلك.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=49&aya=13',
        }
    },
    {
        content: `
        إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "6",
        tafseer:{
            content:`فلهذا لما ذكر صفات المؤمنين حقا, ذكر صفات الكفار المظهرين لكفرهم، المعاندين للرسول يخبر تعالى أن الذين كفروا,- أي: اتصفوا بالكفر, وانصبغوا به, وصار وصفا لهم لازما, لا يردعهم عنه رادع, ولا ينجع فيهم وعظ، إنهم مستمرون على كفرهم, فسواء عليهم أأنذرتهم, أم لم تنذرهم لا يؤمنون، وحقيقة الكفر: هو الجحود لما جاء به الرسول, أو جحد بعضه، فهؤلاء الكفار لا تفيدهم الدعوة إلا إقامة الحجة, وكأن في هذا قطعا لطمع الرسول صلى الله عليه وسلم في إيمانهم, وأنك لا تأس عليهم, ولا تذهب نفسك عليهم حسرات.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=2&aya=6',
        }
    },
    {
        content: `
        وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِينَ
        `,
        sora: `
        هود
        `,
        ayah: "114",
        tafseer: {
            content:`وأقم - أيها الرسول - الصلاة على أحسن وجه في طرفي النهار وهما أول النهار وآخره، وأقمها في ساعات من الليل، إن الأعمال الصالحات تمحو صغائر الذنوب، ذلك المذكور موعظة للمتعظين، وعبرة للمعتبرين.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=11&aya=114',
        }
    },
    {
        content: `
        اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `,
        sora: `
        البقرة
        `,
        ayah: "255",
        tafseer:{
            content:`الله الذي لا إله يُعبد بحقٍّ إلا هو وحده دون سواه، الحي حياة كاملة لا موت فيها ولا نقص، القيوم الذي قام بنفسه فاستغنى عن جميع خلقه، وبه قامت جميع المخلوقات فلا تستغني عنه في كل أحوالها، لا يأخذه نعاس ولا نوم؛ لكمال حياته وقيوميته، له وحده ملك ما في السماوات وما في الأرض، لا يملك أحد أن يشفع عنده لأحد إلا بعد إذنه ورضاه، يعلم ما مضى من أمور خلقه مما وقع، وما يستقبلونه مما لم يقع، ولا يحيطون بشيء من علمه تعالى إلا بما شاء أن يطلعهم عليه، أحاط كرسيه بالسماوات والأرض على سَعَتِهما وعِظَمِهما، ولا يُثْقِلُه أو يشق عليه حفظهما، وهو العَليُّ بذاته وقَدْرِه وقَهْرِه، العظيم في ملكه وسلطانه.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=2&aya=255',
        }
    },
    {
        content: `
        وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ
        `,
        sora: `
        الذاريات
        `,
        ayah: "56",
        tafseer:{
            content:`وما خلقت الجن والإنس إلا لعبادتي وحدي، ما خلقتهم ليجعلوا لي شريكًا.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=51&aya=56',
        }
    },
    {
        content: `
        وَلَن تَرْضَىٰ عَنكَ الْيَهُودُ وَلَا النَّصَارَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ ۗ قُلْ إِنَّ هُدَى اللَّهِ هُوَ الْهُدَىٰ ۗ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَ الَّذِي جَاءَكَ مِنَ الْعِلْمِ ۙ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ
        `,
        sora: `
        البقرة
        `,
        ayah: "120",
        tafseer: {
            content: `يخاطب الله نبيه موجهًا محذرًا قائلًا له: لن ترضى عنك اليهود ولا النصارى حتَّى تترك الإسلام، وتتبع ما هم عليه، قل: إن كتاب الله وبيانه هو الهدى حقًّا، لا ما هم عليه من الباطل، ولئن حصل الاتباع لهم منك أو من أحد من أتباعك بعد الَّذي جاءك من الحق الواضح فلن تجد من الله مناصرة أو معونة، وهذا من باب بيان خطورة ترك الحق ومجاراة أهل الباطل.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=120',
        }
    },
    {
        content: `
        لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ
        `,
        sora: `
        البقرة
        `,
        ayah: "286",
        tafseer: {
            content: `لا يكلف الله نفسًا إلا ما تطيق من الأعمال؛ لأن دين الله مبني على اليسر فلا مشقة فيه، فمن كسب خيرًا فله ثواب ما عمل لا يُنْقَصُ منه شيء، ومن كسب شرًّا فعليه جزاء ما اكتسب من ذنب لا يحمله عنه غيره.
وقال الرسول والمؤمنون: ربنا لا تعاقبنا إن نسينا أو أخطأنا في فعل أو قول بلا قصد منا، ربنا ولا تكلِّفنا ما يشق علينا ولا نطيقه، كما كلَّفت من قبلنا ممن عاقبتهم على ظلمهم كاليهود، ولا تحمِّلنا ما يشق علينا ولا نطيقه من الأوامر والنواهي، وتجاوز عن ذنوبنا، واغفر لنا، وارحمنا بفضلك، أنت ولينا وناصرنا فانصرنا على القوم الكافرين.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=286',
        }
    },
    {
        content: `
        قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا ۚ هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ
        `,
        sora: `
        التوبة
        `,
        ayah: "51",
        tafseer: {
            content: `قل - أيها الرسول - لهؤلاء المنافقين: لن ينالنا إلا ما كتبه الله لنا، فهو سبحانه سيدنا وملجؤنا الذي نلجأ إليه، ونحن متوكلون عليه في أمورنا، وإليه وحده يفوض المؤمنون أمورهم، فهو كافيهم، ونعم الوكيل.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=9&aya=51',
        }
    },
    {
        content: `
        أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا یَكُونُوا۟ كَٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلُ فَطَالَ عَلَیۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِیرࣱ مِّنۡهُمۡ فَـٰسِقُونَ
        `,
        sora: `
        الحديد
        `,
        ayah: "16",
        tafseer: {
            content: `لما ذكر حال المؤمنين والمؤمنات والمنافقين والمنافقات في الدار الآخرة، كان ذلك مما يدعو القلوب إلى الخشوع لربها، والاستكانة لعظمته، فعاتب الله المؤمنين [على عدم ذلك]، فقال: { أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ }أي: ألم يجئ الوقت الذي تلين به قلوبهم وتخشع لذكر الله، الذي هو القرآن، وتنقاد لأوامره وزواجره، وما نزل من الحق الذي جاء به محمد صلى الله عليه وسلم؟ وهذا فيه الحث على الاجتهاد على خشوع القلب لله تعالى، ولما أنزله من الكتاب والحكمة، وأن يتذكر المؤمنون المواعظ الإلهية والأحكام الشرعية كل وقت، ويحاسبوا أنفسهم على ذلك، { وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ }- أي: ولا يكونوا كالذين أنزل الله عليهم الكتاب الموجب لخشوع القلب والانقياد التام، ثم لم يدوموا عليه، ولا ثبتوا، بل طال عليهم الزمان واستمرت بهم الغفلة، فاضمحل إيمانهم وزال إيقانهم، { فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ } فالقلوب تحتاج في كل وقت إلى أن تذكر بما أنزل له الله، وتناطق بالحكمة، ولا ينبغي الغفلة عن ذلك، فإن ذلك سبب لقسوة القلب وجمود العين.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=57&aya=16',
        }
    },
    {
        content: `
        أَتَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبِرِّ وَتَنسَوۡنَ أَنفُسَكُمۡ وَأَنتُمۡ تَتۡلُونَ ٱلۡكِتَـٰبَۚ أَفَلَا تَعۡقِلُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "44",
        tafseer: {
            content: `{ أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ }- أي: بالإيمان والخير { وَتَنْسَوْنَ أَنْفُسَكُمْ }- أي: تتركونها عن أمرها بذلك، والحال: { وَأَنْتُمْ تَتْلُونَ الْكِتَابَ أَفَلَا تَعْقِلُونَ } وأسمى العقل عقلا لأنه يعقل به ما ينفعه من الخير, وينعقل به عما يضره، وذلك أن العقل يحث صاحبه أن يكون أول فاعل لما يأمر به, وأول تارك لما ينهى عنه، فمن أمر غيره بالخير ولم يفعله, أو نهاه عن الشر فلم يتركه, دل على عدم عقله وجهله, خصوصا إذا كان عالما بذلك, قد قامت عليه الحجة.
وهذه الآية, وإن كانت نزلت في سبب بني إسرائيل, فهي عامة لكل أحد لقوله تعالى: { يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ كَبُرَ مَقْتًا عِنْدَ اللَّهِ أَنْ تَقُولُوا مَا لَا تَفْعَلُونَ } وليس في الآية أن الإنسان إذا لم يقم بما أمر به أنه يترك الأمر بالمعروف, والنهي عن المنكر, لأنها دلت على التوبيخ بالنسبة إلى الواجبين، وإلا فمن المعلوم أن على الإنسان واجبين: أمر غيره ونهيه, وأمر نفسه ونهيها، فترك أحدهما, لا يكون رخصة في ترك الآخر، فإن الكمال أن يقوم الإنسان بالواجبين, والنقص الكامل أن يتركهما، وأما قيامه بأحدهما دون الآخر, فليس في رتبة الأول, وهو دون الأخير، وأيضا فإن النفوس مجبولة على عدم الانقياد لمن يخالف قوله فعله، فاقتداؤهم بالأفعال أبلغ من اقتدائهم بالأقوال المجردة.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=44',
        }
    },
    {
        content: `
        وَٱسۡتَعِینُوا۟ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِیرَةٌ إِلَّا عَلَى ٱلۡخَـٰشِعِینَ
        `,
        sora: `
        البقرة
        `,
        ayah: "45",
        tafseer: {
            content: `واطلبوا العون على كل أحوالكم الدينية والدنيوية؛ بالصبر وبالصلاة التي تقربكم إلى الله وتصلكم به، فيعينكم ويحفظكم ويذهب ما بكم من ضر، وإن الصلاة لشاقة وعظيمة إلا على الخاضعين لربهم.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=45',
        }
    },
    {
        content: `
        إِنَّ ٱلۡمُصَّدِّقِینَ وَٱلۡمُصَّدِّقَـٰتِ وَأَقۡرَضُوا۟ ٱللَّهَ قَرۡضًا حَسَنࣰا یُضَـٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرࣱ كَرِیمࣱ
        `,
        sora: `
        الحديد
        `,
        ayah: "18",
        tafseer: {
            content: `ن المتصدقين ببعض أموالهم، والمتصدقات ببعض أموالهنّ، الذين ينفقونها طيبة بها نفوسهم دون مَنٍّ ولا أذى، يُضاعَف لهم ثواب أعمالهم: الحسنة بعشر أمثالها إلى سبع مئة ضعف إلى أضعاف كثيرة، ولهم مع ذلك ثواب كريم عند الله وهو الجنة.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=57&aya=18',
        }
    },
    {
        content: `
        إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَٱلَّذِینَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔینَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَعَمِلَ صَـٰلِحࣰا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "62",
        tafseer:{
            content:`إن مَن آمن مِن هذه الأمة، وكذلك من آمن من الأمم الماضية قبل بعثة محمد صلى الله عليه وسلم من يهود ونصارى وصابئة - وهم طائفة من أتباع بعض الأنبياء - من تحقق فيهم الإيمان بالله وباليوم الآخر؛ فلهم ثوابهم عند ربهم، ولا خوف عليهم مما يستقبلونه في الآخرة، ولا يحزنون على ما فاتهم من الدنيا.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=2&aya=62',
        }
    },
    {
        content: `
        وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا عَدۡلࣱ وَلَا تَنفَعُهَا شَفَـٰعَةࣱ وَلَا هُمۡ یُنصَرُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "123",
        tafseer: {
            content: `واجعلوا بينكم وبين عذاب يوم القيامة وقايةً؛ باتباع أوامر الله واجتناب نواهيه، فإنه لا تُغْنِي - في ذلك اليوم - نفسٌ عن نفس شيئًا، ولا يُقْبل منها فيه أي فداء مهما عَظُمَ، ولا تنفعها فيه شفاعة من أحد مهما علا مكانه، وليس لها نصير ينصرها من دون الله.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=123',
        }
    },
    {
        content: `
        وَمِنۡهُم مَّن یَقُولُ رَبَّنَاۤ ءَاتِنَا فِی ٱلدُّنۡیَا حَسَنَةࣰ وَفِی ٱلۡـَٔاخِرَةِ حَسَنَةࣰ وَقِنَا عَذَابَ ٱلنَّارِ
        `,
        sora: `
        البقرة
        `,
        ayah: "201",
        tafseer: {
            content: `وفريق من الناس مؤمن بالله يؤمن بالآخرة، فيسأل ربه نعيم الدنيا والعمل الصالح فيها، كما يسأله الفوز بالجنة والسلامة من عذاب النار.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=201',
        }
    },
    {
        content: `
        یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱدۡخُلُوا۟ فِی ٱلسِّلۡمِ كَاۤفَّةࣰ وَلَا تَتَّبِعُوا۟ خُطُوَ ٰ⁠تِ ٱلشَّیۡطَـٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوࣱّ مُّبِینࣱ
        `,
        sora: `
        البقرة
        `,
        ayah: "208",
        tafseer: {
            content: `يا أيها الذين آمنوا بالله واتبعوا رسوله ادخلوا في الإسلام جميعه، ولا تتركوا منه شيئًا، كما يفعل أهل الكتاب من الإيمان ببعض الكتاب والكفر ببعضه، ولا تتبعوا مسالك الشيطان؛ لأنه لكم عدو واضح العداوة مُظْهِرُها.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=2&aya=208',
        }
    },
    {
        content: `
        وَجَاءُوا عَلَىٰ قَمِيصِهِ بِدَمٍ كَذِبٍ ۚ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ
        `,
        sora: `
        يوسف
        `,
        ayah: "18",
        tafseer: {
            content: `وأكدوا خبرهم بحيلة، فجاؤوا بقميص يوسف ملطّخًا بدم غير دمه، موهمين أنه أثر أكل الذئب له، ففطن يعقوب - بقرينة أن القميص لم يُمَزَّق- لكذبهم، فقال لهم: ليس الأمر كما أخبرتم، بل زيّنت لكم أنفسكم أمرًا سيئًا صنعتموه به، فأمري صبر جميل لا جزع فيه، والله المطلوب منه العون على ما تذكرونه من أمر يوسف.`,
            source: 'https://surahquran.com/aya_tafseer.php?sora=12&aya=18',
        }
    },
    {
        content: `
        رَّبِّ ٱغۡفِرۡ لِی وَلِوَ ٰ⁠لِدَیَّ وَلِمَن دَخَلَ بَیۡتِیَ مُؤۡمِنࣰا وَلِلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِۖ وَلَا تَزِدِ ٱلظَّـٰلِمِینَ إِلَّا تَبَارَۢا
        `,
        sora: `
        نوح
        `,
        ayah: "28",
    },
    {
        content: `
        وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ
        `,
        sora: `
        فصلت
        `,
        ayah: "34",
    },
    {
        content: `
        مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ
        `,
        sora: `
        ق
        `,
        ayah: "18",
    },
    {
        content: `
        فَلَا تُزَكُّوا أَنفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ اتَّقَىٰ
        `,
        sora: `
        النجم
        `,
        ayah: "32",
    },
    {
        content: `
        إِنَّمَا يَخْشَى اللَّـهَ مِنْ عِبَادِهِ الْعُلَمَاءُ
        `,
        sora: `
        فاطر
        `,
        ayah: "28",
    },
    {
        content: `
        لَئِن شَكَرْ‌تُمْ لَأَزِيدَنَّكُمْ
        `,
        sora: `
        إبراهيم
        `,
        ayah: "7",
    },
    {
        content: `
        فَاذْكُرُ‌ونِي أَذْكُرْ‌كُمْ
        `,
        sora: `
        البقرة
        `,
        ayah: "152",
    },
    {
        content: `
        وَإِذۡ جَعَلۡنَا ٱلۡبَیۡتَ مَثَابَةࣰ لِّلنَّاسِ وَأَمۡنࣰا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبۡرَ ٰ⁠هِـۧمَ مُصَلࣰّىۖ وَعَهِدۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِـۧمَ وَإِسۡمَـٰعِیلَ أَن طَهِّرَا بَیۡتِیَ لِلطَّاۤىِٕفِینَ وَٱلۡعَـٰكِفِینَ وَٱلرُّكَّعِ ٱلسُّجُودِ
        `,
        sora: `
        البقرة
        `,
        ayah: "125",
    },
    {
        content: `لَّقَدْ كُنتَ فِي غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ`,
        sora: `ق`,
        ayah: "22"
    },
    {
        content: `يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ `,
        sora: 'النساء',
        ayah: "26"
    },
    {
        continue: ` أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ`,
        sora: `البقرة`,
        ayah: "75"
    },
    {
        content: `يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ`,
        sora: `الحجرات`,
        ayah: "6"
    },
    {
        content: `وَقالَ إِنِّي ذاهِبٌ إِلى رَبِّي سَيَهْدِينِ`,
        sora: `الصافات`,
        ayah: "99"
    },
    {
        content: ` فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ`,
        sora: `الطور`,
        ayah: "27"
    },
    {
        content: `يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ`,
        sora: "البقرة",
        ayah: "21"
    },
    {
        content: `كل من عليها فانٍ * ويبقى وجه ربّك ذو الجلال والإكرام`,
        sora: 'الرحمن',
        ayah: "27-26"
    },
    {
        content: ' إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ',
        sora: "الحج",
        ayah: "2"
    },
    {
        content: `
        قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّـهِ إِنَّ اللَّـهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ
        `,
        sora: "الزمر",
        ayah: "53"
    },
    {
        content: `
        فَاصْبِرْ صَبْرًا جَمِيلً
        `,
        sora: "المعارج",
        ayah: "5"
    },
    {
        content: `
        فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِّن نَّهَارٍ بَلَاغٌ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ
        `,
        sora: "الأحقاف",
        ayah: "35"
    },
    {
        content: `
        هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا
        `,
        sora: "الأحزاب",
        ayah: "43"
    },
    {
        content: `
        وَإِذا جاءَكَ الَّذينَ يُؤمِنونَ بِآياتِنا فَقُل سَلامٌ عَلَيكُم كَتَبَ رَبُّكُم عَلى نَفسِهِ الرَّحمَةَ أَنَّهُ مَن عَمِلَ مِنكُم سوءًا بِجَهالَةٍ ثُمَّ تابَ مِن بَعدِهِ وَأَصلَحَ فَأَنَّهُ غَفورٌ رَحيمٌ
        `,
        sora: "الأنعام",
        ayah: "54"
    },
    {
        content: `
        وَمَن تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّـهِ مَتَابًا
        `,
        sora: "الفرقان",
        ayah: "71"
    },
    {
        content: `
        وَإِنّي لَغَفّارٌ لِمَن تابَ وَآمَنَ وَعَمِلَ صالِحًا ثُمَّ اهتَدى
        `,
        sora: "طه",
        ayah: "82"
    },
    {
        content: `
        وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاء وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُم بِآيَاتِنَا يُؤْمِنُونَ
        `,
        sora: "الأعراف",
        ayah: "156"
    },
    {
        content: `
        مَن جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ
        `,
        sora: "القصص",
        ayah: "84"
    },
    {
        content: `
        أَلَم يَعلَموا أَنَّ اللَّـهَ هُوَ يَقبَلُ التَّوبَةَ عَن عِبادِهِ وَيَأخُذُ الصَّدَقاتِ وَأَنَّ اللَّـهَ هُوَ التَّوّابُ الرَّحيمُ
        `,
        sora: "التوبه",
        ayah: "104"
    },
    {
        content: `
        وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّـهَ يَجِدِ اللَّـهَ غَفُورًا رَّحِيمًا
        `,
        sora: "النساء",
        ayah: "110"
    },
    {
        content: `
        قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ
        `,
        sora: "آل عمران",
        ayah: "31"
    },
    {
        content: `
        وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا
        `,
        sora: "الإسراء",
        ayah: "29"
    },
    {
        content: `
        فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ
        `,
        sora: "القصص",
        ayah: "24"
    },
    {
        content: ` يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ`,
        sora: `يوسف`,
        ayah: "87"
    },
    {
        content: `
        يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ إِنَّ اللَّـهَ مَعَ الصَّابِرِينَ
        `,
        sora: `البقرة`,
        ayah: "153"
    },
    {
        content: `قَالُوا أَإِنَّكَ لَأَنْتَ يُوسُفُ ۖ قَالَ أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا ۖ إِنَّهُ مَنْ يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ`,
        sora: `يوسف`,
        ayah: "90"
    },
    {
        content: `لَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ* الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّـهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ* أُولَـئكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولـئِكَ هُمُ الْمُهْتَدُونَ`,
        sora: `البقرة`,
        ayah: "157-155"
    },
    {
        content: `قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَـذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّـهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ`,
        sora: `الزمر`,
        ayah: "10"
    },
    {
        content: `اللَّـهُ الَّذي رَفَعَ السَّماواتِ بِغَيرِ عَمَدٍ تَرَونَها ثُمَّ استَوى عَلَى العَرشِ وَسَخَّرَ الشَّمسَ وَالقَمَرَ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى يُدَبِّرُ الأَمرَ يُفَصِّلُ الآياتِ لَعَلَّكُم بِلِقاءِ رَبِّكُم توقِنونَ`,
        sora: `الرعد`,
        ayah: "2"
    },
    {
        content: `وَهُوَ الَّذي أَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ نَباتَ كُلِّ شَيءٍ فَأَخرَجنا مِنهُ خَضِرًا نُخرِجُ مِنهُ حَبًّا مُتَراكِبًا وَمِنَ النَّخلِ مِن طَلعِها قِنوانٌ دانِيَةٌ وَجَنّاتٍ مِن أَعنابٍ وَالزَّيتونَ وَالرُّمّانَ مُشتَبِهًا وَغَيرَ مُتَشابِهٍ انظُروا إِلى ثَمَرِهِ إِذا أَثمَرَ وَيَنعِهِ إِنَّ في ذلِكُم لَآياتٍ لِقَومٍ يُؤمِنونَ`,
        sora: `الأنعام`,
        ayah: "99"
    },
    {
        content: `اللَّـهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّـهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّـهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا`,
        sora: `الطلاق`,
        ayah: "12"
    },
    {
        content: `إِنَّ رَبَّكُمُ اللَّـهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ في سِتَّةِ أَيّامٍ ثُمَّ استَوى عَلَى العَرشِ يُغشِي اللَّيلَ النَّهارَ يَطلُبُهُ حَثيثًا وَالشَّمسَ وَالقَمَرَ وَالنُّجومَ مُسَخَّراتٍ بِأَمرِهِ أَلا لَهُ الخَلقُ وَالأَمرُ تَبارَكَ اللَّـهُ رَبُّ العالَمينَ`,
        sora: `الأعراف`,
        ayah: "54"
    },
    {
        content: `إِنَّ لِلْمُتَّقِينَ مَفَازًا*حَدَائِقَ وَأَعْنَابًا*وَكَوَاعِبَ أَتْرَابًا*وَكَأْسًا دِهَاقًا*لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا*جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا`,
        sora: `النبأ`,
        ayah: "36-31"
    },
    {
        content: `إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا وَلِبَاسُهُمْ فِيهَا حَرِيرٌ*وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَى صِرَاطِ الْحَمِيدِ`,
        sora: `الحج`,
        ayah: "24-23"
    },
    {
        content: `وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ*لِسَعْيِهَا رَاضِيَةٌ*فِي جَنَّةٍ عَالِيَةٍ*لَا تَسْمَعُ فِيهَا لَاغِيَةً*فِيهَا عَيْنٌ جَارِيَةٌ*فِيهَا سُرُرٌ مَرْفُوعَةٌ*وَأَكْوَابٌ مَوْضُوعَةٌ*وَنَمَارِقُ مَصْفُوفَةٌ*وَزَرَابِيُّ مَبْثُوثَةٌ`,
        sora: `الغاشية`,
        ayah: "16-8"
    },
    {
        content: `وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا شَفَـٰعَةࣱ وَلَا یُؤۡخَذُ مِنۡهَا عَدۡلࣱ وَلَا هُمۡ یُنصَرُونَ`,
        sora: `البقرة`,
        ayah: "48"
    },
    {
        content: `فَقُلۡتُ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارࣰا * یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا`,
        sora: `نوح`,
        ayah: "11-10"
    },
    {
        content: `أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ لَوَجَدُوا۟ فِيهِ ٱخْتِلَٰفًا كَثِيرًا`,
        sora: `النساء`,
        ayah: "82"
    },
    {
        content: `وَإِذَا قُرِئَ ٱلْقُرْءَانُ فَٱسْتَمِعُوا۟ لَهُۥ وَأَنصِتُوا۟ لَعَلَّكُمْ تُرْحَمُونَ`,
        sora: `الأعراف`,
        ayah: "204"
    },
    {
        content: `قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ أَمَّن يَمْلِكُ ٱلسَّمْعَ وَٱلْأَبْصَٰرَ وَمَن يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ وَمَن يُدَبِّرُ ٱلْأَمْرَ فَسَيَقُولُونَ ٱللَّهُ فَقُلْ أَفَلَا تَتَّقُونَ`,
        sora: `يونس`,
        ayah: "31"
    },
    {
        content:`إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ`,
        sora:'الحجر',
        ayah:'9',
        tafseer:{
            content:`( إِنَّا نَحْنُ نزلْنَا الذِّكْرَ )- أي: القرآن الذي فيه ذكرى لكل شيء من المسائل والدلائل الواضحة، وفيه يتذكر من أراد التذكر، ( وَإِنَّا لَهُ لَحَافِظُونَ )- أي: في حال إنزاله وبعد إنزاله، ففي حال إنزاله حافظون له من استراق كل شيطان رجيم، وبعد إنزاله أودعه الله في قلب رسوله، واستودعه فيها ثم في قلوب أمته، وحفظ الله ألفاظه من التغيير فيها والزيادة والنقص، ومعانيه من التبديل، فلا يحرف محرف معنى من معانيه إلا وقيض الله له من يبين الحق المبين، وهذا من أعظم آيات الله ونعمه على عباده المؤمنين، ومن حفظه أن الله يحفظ أهله من أعدائهم، ولا يسلط عليهم عدوا يجتاحهم.`,
            source:'https://surahquran.com/aya-tafsir-9-15.html'
        }
    },
    {
        content:`وَمَآ أَنزَلْنَا عَلَيْكَ ٱلْكِتَٰبَ إِلَّا لِتُبَيِّنَ لَهُمُ ٱلَّذِى ٱخْتَلَفُوا۟ فِيهِ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ`,
        sora:'النحل',
        ayah:'64',
        tafseer:{
            content:`وما أنزلنا عليك - أيها الرسول - القرآن إلا لتبين لجميع الناس ما اختلفوا فيه من التوحيد والبعث وأحكام الشرع، وأن يكون القرآن هداية ورحمة للمؤمنين بالله وبرسله، وبما جاء به القرآن، فهم الذين ينتفعون بالحق.`,
            source:'https://surahquran.com/aya_tafseer.php?sora=16&aya=64'
        }
    },
    {
       content:`إِنَّ هَٰذَا ٱلْقُرْءَانَ يَهْدِى لِلَّتِى هِىَ أَقْوَمُ وَيُبَشِّرُ ٱلْمُؤْمِنِينَ ٱلَّذِينَ يَعْمَلُونَ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا`,
       sora:'الإسراء ',
       ayah:'9',
       tafseer:{
        content:`إن هذا القرآن المنزل على محمد صلى الله عليه وسلم يدل على أحسن السُّبُل وهي سبيل الإسلام، ويخبر المؤمنين بالله الذين يعملون الأعمال الصالحات بما يسرهم، وهو أن لهم ثوابًا عظيمًا من الله`,
        source:'https://surahquran.com/aya_tafseer.php?sora=17&aya=9',
       }
    }, 
    {
      content:`وَلَقَدْ صَرَّفْنَا فِي هَٰذَا الْقُرْآنِ لِلنَّاسِ مِن كُلِّ مَثَلٍ ۚ وَكَانَ الْإِنسَانُ أَكْثَرَ شَيْءٍ جَدَلًا`,
      sora:'الكهف',
      ayah:'54',
      tafseer:{
        content:`ولقد بيّنا ونوّعنا في هذا القرآن المنزل على محمد صلى الله عليه وسلم الكثير من أنواع الأمثال ليتذكروا ويتّعظوا، لكن الإنسان - وخاصة الكافر - أكثر شيء يظهر منه المجادلة بغير الحق.`,
        source:'https://surahquran.com/aya_tafseer.php?sora=18&aya=54',
        }
    },
    {
      content:`وَاتْلُ مَا أُوحِيَ إِلَيْكَ مِن كِتَابِ رَبِّكَ ۖ لَا مُبَدِّلَ لِكَلِمَاتِهِ وَلَن تَجِدَ مِن دُونِهِ مُلْتَحَدًا`,
      sora:'الكهف',
      ayah:'27',
      tafseer:{
        content:`واقرأ - أيها الرسول - واعمل بما أوحى الله به إليك من القرآن، فلا مبدل لكلماته؛ لأنها صدق كلها وعدل كلها، ولن تجد من دونه سبحانه ملجأً تلجأ إليه، ولا معاذًا تعوذ به سواه.`,
        source:'https://surahquran.com/aya_tafseer.php?sora=18&aya=27',
        }
    },
    {
        content:`وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ٱلْقُرْءَانُ جُمْلَةً وَٰحِدَةً كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَ وَرَتَّلْنَٰهُ تَرْتِيلًا`,
      sora:'الفرقان',
      ayah:'32',
      tafseer:{
          content:`وقال الذين كفروا بالله: هلَّا نُزِّل على الرسول هذا القرآن دفعة واحدة، ولم يُنَزَّل عليه مفرقًا، نزّلنا القرآن كذلك مفرقًا لتثبيت قلبك - أيها الرسول - بنزوله مرة بعد مرة، وأنزلناه شيئًا بعد شيء لتسهيل فهمه وحفظه.`,
          source:'https://surahquran.com/aya_tafseer.php?sora=25&aya=32',
        }
    },
]

module.exports = { verses }