const verses = [
    {
        content: `
        إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا
        `,
        sora: `
        الأحزاب
        `,
        ayah: "56",
    },
    {
        content: `
        الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ
        `,
        sora: `
        الرعد
        `,
        ayah: "28",
    },
    {
        content: `
        وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "186",
    },
    {
        content: `
        يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُم مِّن ذَكَرٍ وَأُنثَىٰ وَجَعَلْنَاكُمْ شُعُوبًا وَقَبَائِلَ لِتَعَارَفُوا ۚ إِنَّ أَكْرَمَكُمْ عِندَ اللَّهِ أَتْقَاكُمْ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ
        `,
        sora: `
        الحجرات
        `,
        ayah: "13",
    },
    {
        content: `
        إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "6",
    },
    {
        content: `
        وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ۚ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ۚ ذَٰلِكَ ذِكْرَىٰ لِلذَّاكِرِينَ
        `,
        sora: `
        هود
        `,
        ayah: "114",
    },
    {
        content: `
        اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `,
        sora: `
        البقرة
        `,
        ayah: "255",
    },
    {
        content: `
        وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ
        `,
        sora: `
        الذاريات
        `,
        ayah: "56",
    },
    {
        content: `
        وَلَن تَرْضَىٰ عَنكَ الْيَهُودُ وَلَا النَّصَارَىٰ حَتَّىٰ تَتَّبِعَ مِلَّتَهُمْ ۗ قُلْ إِنَّ هُدَى اللَّهِ هُوَ الْهُدَىٰ ۗ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَ الَّذِي جَاءَكَ مِنَ الْعِلْمِ ۙ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ
        `,
        sora: `
        البقرة
        `,
        ayah: "120",
    },
    {
        content: `
        لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ
        `,
        sora: `
        البقرة
        `,
        ayah: "286",
    },
    {
        content: `
        قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا ۚ هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ
        `,
        sora: `
        التوبة
        `,
        ayah: "51",
    },
    {
        content: `
        أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ وَلَا یَكُونُوا۟ كَٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلُ فَطَالَ عَلَیۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِیرࣱ مِّنۡهُمۡ فَـٰسِقُونَ
        `,
        sora: `
        الحديد
        `,
        ayah: "16",
    },
    {
        content: `
        أَتَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبِرِّ وَتَنسَوۡنَ أَنفُسَكُمۡ وَأَنتُمۡ تَتۡلُونَ ٱلۡكِتَـٰبَۚ أَفَلَا تَعۡقِلُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "44",
    },
    {
        content: `
        وَٱسۡتَعِینُوا۟ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ وَإِنَّهَا لَكَبِیرَةٌ إِلَّا عَلَى ٱلۡخَـٰشِعِینَ
        `,
        sora: `
        البقرة
        `,
        ayah: "45",
    },
    {
        content: `
        إِنَّ ٱلۡمُصَّدِّقِینَ وَٱلۡمُصَّدِّقَـٰتِ وَأَقۡرَضُوا۟ ٱللَّهَ قَرۡضًا حَسَنࣰا یُضَـٰعَفُ لَهُمۡ وَلَهُمۡ أَجۡرࣱ كَرِیمࣱ
        `,
        sora: `
        الحديد
        `,
        ayah: "18",
    },
    {
        content: `
        إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَٱلَّذِینَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔینَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَعَمِلَ صَـٰلِحࣰا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "62",
    },
    {
        content: `
        وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا عَدۡلࣱ وَلَا تَنفَعُهَا شَفَـٰعَةࣱ وَلَا هُمۡ یُنصَرُونَ
        `,
        sora: `
        البقرة
        `,
        ayah: "123",
    },
    {
        content: `
        وَمِنۡهُم مَّن یَقُولُ رَبَّنَاۤ ءَاتِنَا فِی ٱلدُّنۡیَا حَسَنَةࣰ وَفِی ٱلۡـَٔاخِرَةِ حَسَنَةࣰ وَقِنَا عَذَابَ ٱلنَّارِ
        `,
        sora: `
        البقرة
        `,
        ayah: "201",
    },
    {
        content: `
        یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱدۡخُلُوا۟ فِی ٱلسِّلۡمِ كَاۤفَّةࣰ وَلَا تَتَّبِعُوا۟ خُطُوَ ٰ⁠تِ ٱلشَّیۡطَـٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوࣱّ مُّبِینࣱ
        `,
        sora: `
        البقرة
        `,
        ayah: "208",
    },
    {
        content: `
        فَصَبۡرࣱ جَمِیلࣱۖ وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ
        `,
        sora: `
        يوسف
        `,
        ayah: "18",
    },
    {
        content: `
        رَّبِّ ٱغۡفِرۡ لِی وَلِوَ ٰ⁠لِدَیَّ وَلِمَن دَخَلَ بَیۡتِیَ مُؤۡمِنࣰا وَلِلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِۖ وَلَا تَزِدِ ٱلظَّـٰلِمِینَ إِلَّا تَبَارَۢا
        `,
        sora: `
        نوح
        `,
        ayah: "28",
    },
    {
        content: `
        وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ
        `,
        sora: `
        فصلت
        `,
        ayah: "34",
    },
    {
        content: `
        مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ
        `,
        sora: `
        ق
        `,
        ayah: "18",
    },
    {
        content: `
        فَلَا تُزَكُّوا أَنفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ اتَّقَىٰ
        `,
        sora: `
        النجم
        `,
        ayah: "32",
    },
    {
        content: `
        إِنَّمَا يَخْشَى اللَّـهَ مِنْ عِبَادِهِ الْعُلَمَاءُ
        `,
        sora: `
        فاطر
        `,
        ayah: "28",
    },
    {
        content: `
        لَئِن شَكَرْ‌تُمْ لَأَزِيدَنَّكُمْ
        `,
        sora: `
        إبراهيم
        `,
        ayah: "7",
    },
    {
        content: `
        فَاذْكُرُ‌ونِي أَذْكُرْ‌كُمْ
        `,
        sora: `
        البقرة
        `,
        ayah: "152",
    },
    {
        content: `
        وَإِذۡ جَعَلۡنَا ٱلۡبَیۡتَ مَثَابَةࣰ لِّلنَّاسِ وَأَمۡنࣰا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبۡرَ ٰ⁠هِـۧمَ مُصَلࣰّىۖ وَعَهِدۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِـۧمَ وَإِسۡمَـٰعِیلَ أَن طَهِّرَا بَیۡتِیَ لِلطَّاۤىِٕفِینَ وَٱلۡعَـٰكِفِینَ وَٱلرُّكَّعِ ٱلسُّجُودِ
        `,
        sora: `
        البقرة
        `,
        ayah: "125",
    }, {
        content: `لَّقَدْ كُنتَ فِي غَفْلَةٍ مِّنْ هَٰذَا فَكَشَفْنَا عَنكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ`,
        sora: `ق`,
        ayah: "22"
    },
    {
        content: `يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ `,
        sora: 'النساء',
        ayah: "26"
    },
    {
        continue: ` أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ`,
        sora: `البقرة`,
        ayah: "75"
    },
    {
        content: `يَا أَيُّهَا الَّذِينَ آمَنُوا إِن جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَن تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَىٰ مَا فَعَلْتُمْ نَادِمِينَ`,
        sora: `الحجرات`,
        ayah: "6"
    },
    {
        content: `وَقالَ إِنِّي ذاهِبٌ إِلى رَبِّي سَيَهْدِينِ`,
        sora: `الصافات`,
        ayah: "99"
    },
    {
        content: ` فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ`,
        sora: `الطور`,
        ayah: "27"
    },
    {
        content: `يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ`,
        sora: "البقرة",
        ayah: "21"
    },
    {
        content: `كل من عليها فانٍ * ويبقى وجه ربّك ذو الجلال والإكرام`,
        sora: 'الرحمن',
        ayah: "27-26"
    },
    {
        content: ' إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ',
        sora: "الحج",
        ayah: "2"
    },
    {
        content: `
        قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّـهِ إِنَّ اللَّـهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ
`,
        sora: "الزمر",
        ayah: "53"
    },
    {
        content: `
       فَاصْبِرْ صَبْرًا جَمِيلً
`,
        sora: "المعارج",
        ayah: "5"
    },
    {
        content: `
        فَاصْبِرْ كَمَا صَبَرَ أُولُو الْعَزْمِ مِنَ الرُّسُلِ وَلَا تَسْتَعْجِل لَّهُمْ كَأَنَّهُمْ يَوْمَ يَرَوْنَ مَا يُوعَدُونَ لَمْ يَلْبَثُوا إِلَّا سَاعَةً مِّن نَّهَارٍ بَلَاغٌ فَهَلْ يُهْلَكُ إِلَّا الْقَوْمُ الْفَاسِقُونَ
`,
        sora: "الأحقاف",
        ayah: "35"
    },
    {
        content: `
       هُوَ الَّذِي يُصَلِّي عَلَيْكُمْ وَمَلَائِكَتُهُ لِيُخْرِجَكُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ وَكَانَ بِالْمُؤْمِنِينَ رَحِيمًا
`,
        sora: "الأحزاب",
        ayah: "43"
    },
    {
        content: `
       وَإِذا جاءَكَ الَّذينَ يُؤمِنونَ بِآياتِنا فَقُل سَلامٌ عَلَيكُم كَتَبَ رَبُّكُم عَلى نَفسِهِ الرَّحمَةَ أَنَّهُ مَن عَمِلَ مِنكُم سوءًا بِجَهالَةٍ ثُمَّ تابَ مِن بَعدِهِ وَأَصلَحَ فَأَنَّهُ غَفورٌ رَحيمٌ
`,
        sora: "الأنعام",
        ayah: "54"
    },
    {
        content: `
       وَمَن تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّـهِ مَتَابًا
`,
        sora: "الفرقان",
        ayah: "71"
    },
    {
        content: `
       وَإِنّي لَغَفّارٌ لِمَن تابَ وَآمَنَ وَعَمِلَ صالِحًا ثُمَّ اهتَدى

`,
        sora: "طه",
        ayah: "82"
    },
    {
        content: `
       وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاء وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُم بِآيَاتِنَا يُؤْمِنُونَ
`,
        sora: "الأعراف",
        ayah: "156"
    },
    {
        content: `
       مَن جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِّنْهَا وَمَن جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا السَّيِّئَاتِ إِلَّا مَا كَانُوا يَعْمَلُونَ
`,
        sora: "القصص",
        ayah: "84"
    },
    {
        content: `
       أَلَم يَعلَموا أَنَّ اللَّـهَ هُوَ يَقبَلُ التَّوبَةَ عَن عِبادِهِ وَيَأخُذُ الصَّدَقاتِ وَأَنَّ اللَّـهَ هُوَ التَّوّابُ الرَّحيمُ
`,
        sora: "التوبه",
        ayah: "104"
    },
    {
        content: `
       وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّـهَ يَجِدِ اللَّـهَ غَفُورًا رَّحِيمًا
`,
        sora: "النساء",
        ayah: "110"
    },
    {
        content: `
        قُلْ إِن كُنتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ
`,
        sora: "آل عمران",
        ayah: "31"
    },
    {
        content: `
        وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا
`,
        sora: "الإسراء",
        ayah: "29"
    },
    {
        content: `
       فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰ إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ
`,
        sora: "القصص",
        ayah: "24"
    },    
    {
        content:` يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ`,
        sora:`يوسف`,
        ayah:"87"
    },
    {
        content: `يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ إِنَّ اللَّـهَ مَعَ الصَّابِرِينَ
        `,
        sora: `البقرة`,
        ayah: "153"
    },
    {
        content: `قَالُوا أَإِنَّكَ لَأَنْتَ يُوسُفُ ۖ قَالَ أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا ۖ إِنَّهُ مَنْ يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ`,
        sora: `يوسف`,
        ayah: "90"
    },
    {
        content: 
    `لَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ* الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّـهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ* أُولَـئكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولـئِكَ هُمُ الْمُهْتَدُونَ`
    ,
        sora: `البقرة`,
        ayah: "157-155"
    },
    {
        content: `قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَـذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّـهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ`,
        sora: `الزمر`,
        ayah: "10"
    },
    {
        content: `اللَّـهُ الَّذي رَفَعَ السَّماواتِ بِغَيرِ عَمَدٍ تَرَونَها ثُمَّ استَوى عَلَى العَرشِ وَسَخَّرَ الشَّمسَ وَالقَمَرَ كُلٌّ يَجري لِأَجَلٍ مُسَمًّى يُدَبِّرُ الأَمرَ يُفَصِّلُ الآياتِ لَعَلَّكُم بِلِقاءِ رَبِّكُم توقِنونَ`,
        sora: `الرعد`,
        ayah: "2"
    },
    {
        content: `وَهُوَ الَّذي أَنزَلَ مِنَ السَّماءِ ماءً فَأَخرَجنا بِهِ نَباتَ كُلِّ شَيءٍ فَأَخرَجنا مِنهُ خَضِرًا نُخرِجُ مِنهُ حَبًّا مُتَراكِبًا وَمِنَ النَّخلِ مِن طَلعِها قِنوانٌ دانِيَةٌ وَجَنّاتٍ مِن أَعنابٍ وَالزَّيتونَ وَالرُّمّانَ مُشتَبِهًا وَغَيرَ مُتَشابِهٍ انظُروا إِلى ثَمَرِهِ إِذا أَثمَرَ وَيَنعِهِ إِنَّ في ذلِكُم لَآياتٍ لِقَومٍ يُؤمِنونَ`,
        sora: `الأنعام`,
        ayah: "99"
    },
    {
        content: `اللَّـهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّـهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّـهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا`,
        sora: `الطلاق`,
        ayah: "12"
    },
    {
        content: `إِنَّ رَبَّكُمُ اللَّـهُ الَّذي خَلَقَ السَّماواتِ وَالأَرضَ في سِتَّةِ أَيّامٍ ثُمَّ استَوى عَلَى العَرشِ يُغشِي اللَّيلَ النَّهارَ يَطلُبُهُ حَثيثًا وَالشَّمسَ وَالقَمَرَ وَالنُّجومَ مُسَخَّراتٍ بِأَمرِهِ أَلا لَهُ الخَلقُ وَالأَمرُ تَبارَكَ اللَّـهُ رَبُّ العالَمينَ`,
        sora: `الأعراف`,
        ayah: "54"
    },
    {
        content: `إِنَّ لِلْمُتَّقِينَ مَفَازًا*حَدَائِقَ وَأَعْنَابًا*وَكَوَاعِبَ أَتْرَابًا*وَكَأْسًا دِهَاقًا*لَا يَسْمَعُونَ فِيهَا لَغْوًا وَلَا كِذَّابًا*جَزَاءً مِنْ رَبِّكَ عَطَاءً حِسَابًا`,
        sora: `النبأ`,
        ayah: "36-31"
    },
    {
        content: `إِنَّ اللَّهَ يُدْخِلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِنْ ذَهَبٍ وَلُؤْلُؤًا وَلِبَاسُهُمْ فِيهَا حَرِيرٌ*وَهُدُوا إِلَى الطَّيِّبِ مِنَ الْقَوْلِ وَهُدُوا إِلَى صِرَاطِ الْحَمِيدِ`,
        sora: `الحج`,
        ayah: "24-23"
    },
    {
        content: `وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ*لِسَعْيِهَا رَاضِيَةٌ*فِي جَنَّةٍ عَالِيَةٍ*لَا تَسْمَعُ فِيهَا لَاغِيَةً*فِيهَا عَيْنٌ جَارِيَةٌ*فِيهَا سُرُرٌ مَرْفُوعَةٌ*وَأَكْوَابٌ مَوْضُوعَةٌ*وَنَمَارِقُ مَصْفُوفَةٌ*وَزَرَابِيُّ مَبْثُوثَةٌ`,
        sora: `الغاشية`,
        ayah: "16-8"
    },
    {
        content: `وَٱتَّقُوا۟ یَوۡمࣰا لَّا تَجۡزِی نَفۡسٌ عَن نَّفۡسࣲ شَیۡـࣰٔا وَلَا یُقۡبَلُ مِنۡهَا شَفَـٰعَةࣱ وَلَا یُؤۡخَذُ مِنۡهَا عَدۡلࣱ وَلَا هُمۡ یُنصَرُونَ`,
        sora: `البقرة`,
        ayah: "48"
    },
    {
        content: `فَقُلۡتُ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارࣰا * یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا`,
        sora: `نوح`,
        ayah: "11-10"
    },
    {
        content: `أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ لَوَجَدُوا۟ فِيهِ ٱخْتِلَٰفًا كَثِيرًا`,
        sora: `النساء`,
        ayah: "82"
    },
    {
        content: `وَإِذَا قُرِئَ ٱلْقُرْءَانُ فَٱسْتَمِعُوا۟ لَهُۥ وَأَنصِتُوا۟ لَعَلَّكُمْ تُرْحَمُونَ`,
        sora: `الأعراف`,
        ayah: "204"
    },
    {
        content: `قُلْ مَن يَرْزُقُكُم مِّنَ ٱلسَّمَآءِ وَٱلْأَرْضِ أَمَّن يَمْلِكُ ٱلسَّمْعَ وَٱلْأَبْصَٰرَ وَمَن يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَيُخْرِجُ ٱلْمَيِّتَ مِنَ ٱلْحَىِّ وَمَن يُدَبِّرُ ٱلْأَمْرَ فَسَيَقُولُونَ ٱللَّهُ فَقُلْ أَفَلَا تَتَّقُونَ`,
        sora: `يونس`,
        ayah: "31"
    }

]

module.exports = { verses }